/* automatically generated by rust-bindgen 0.71.1 */

pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_FMA: u32 = 1;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_HMMA: u32 = 2;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_IMMA: u32 = 4;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_DMMA: u32 = 8;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_TENSOR_OP_MASK: u32 = 254;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_OP_TYPE_MASK: u32 = 255;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_ACCUMULATOR_16F: u32 = 256;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_ACCUMULATOR_32F: u32 = 512;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_ACCUMULATOR_64F: u32 = 1024;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_ACCUMULATOR_32I: u32 = 2048;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_ACCUMULATOR_TYPE_MASK: u32 = 65280;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_INPUT_16F: u32 = 65536;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_INPUT_16BF: u32 = 131072;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_INPUT_TF32: u32 = 262144;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_INPUT_32F: u32 = 524288;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_INPUT_64F: u32 = 1048576;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_INPUT_8I: u32 = 2097152;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_INPUT_8F_E4M3: u32 = 4194304;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_INPUT_8F_E5M2: u32 = 8388608;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_OP_INPUT_TYPE_MASK: u32 = 16711680;
pub const CUBLASLT_NUMERICAL_IMPL_FLAGS_GAUSSIAN: u64 = 4294967296;
pub type __off_t = ::std::os::raw::c_long;

#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum libraryPropertyType_t {
    MAJOR_VERSION = 0,
    MINOR_VERSION = 1,
    PATCH_LEVEL = 2,
}
pub use self::libraryPropertyType_t as libraryPropertyType;
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasStatus_t {
    CUBLAS_STATUS_SUCCESS = 0,
    CUBLAS_STATUS_NOT_INITIALIZED = 1,
    CUBLAS_STATUS_ALLOC_FAILED = 3,
    CUBLAS_STATUS_INVALID_VALUE = 7,
    CUBLAS_STATUS_ARCH_MISMATCH = 8,
    CUBLAS_STATUS_MAPPING_ERROR = 11,
    CUBLAS_STATUS_EXECUTION_FAILED = 13,
    CUBLAS_STATUS_INTERNAL_ERROR = 14,
    CUBLAS_STATUS_NOT_SUPPORTED = 15,
    CUBLAS_STATUS_LICENSE_ERROR = 16,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasComputeType_t {
    CUBLAS_COMPUTE_16F = 64,
    CUBLAS_COMPUTE_16F_PEDANTIC = 65,
    CUBLAS_COMPUTE_32F = 68,
    CUBLAS_COMPUTE_32F_PEDANTIC = 69,
    CUBLAS_COMPUTE_32F_FAST_16F = 74,
    CUBLAS_COMPUTE_32F_FAST_16BF = 75,
    CUBLAS_COMPUTE_32F_FAST_TF32 = 77,
    CUBLAS_COMPUTE_64F = 70,
    CUBLAS_COMPUTE_64F_PEDANTIC = 71,
    CUBLAS_COMPUTE_32I = 72,
    CUBLAS_COMPUTE_32I_PEDANTIC = 73,
}
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
impl Default for _IO_FILE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cublasLtContext {
    _unused: [u8; 0],
}
#[doc = " Opaque structure holding CUBLASLT context"]
pub type cublasLtHandle_t = *mut cublasLtContext;
unsafe extern "C" {
    pub fn cublasLtCreate(lightHandle: *mut cublasLtHandle_t) -> cublasStatus_t;
}
unsafe extern "C" {
    pub fn cublasLtDestroy(lightHandle: cublasLtHandle_t) -> cublasStatus_t;
}
unsafe extern "C" {
    pub fn cublasLtGetStatusName(status: cublasStatus_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn cublasLtGetStatusString(status: cublasStatus_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn cublasLtGetVersion() -> usize;
}
unsafe extern "C" {
    pub fn cublasLtGetCudartVersion() -> usize;
}
unsafe extern "C" {
    pub fn cublasLtGetProperty(
        type_: libraryPropertyType,
        value: *mut ::std::os::raw::c_int,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    pub fn cublasLtHeuristicsCacheGetCapacity(capacity: *mut usize) -> cublasStatus_t;
}
unsafe extern "C" {
    pub fn cublasLtHeuristicsCacheSetCapacity(capacity: usize) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Restricts usage of CPU instructions (ISA) specified by the flags in the mask.\n\n Flags can be combined with bitwise OR(|) operator. Supported flags:\n - 0x1 -- x86-64 AVX512 ISA\n\n Default mask: 0 (any applicable ISA is allowed).\n\n The function returns the previous value of the mask.\n The function takes precedence over the environment variable CUBLASLT_DISABLE_CPU_INSTRUCTIONS_MASK."]
    pub fn cublasLtDisableCpuInstructionsSetMask(
        mask: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
#[doc = " Semi-opaque descriptor for matrix memory layout"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct cublasLtMatrixLayoutOpaque_t {
    pub data: [u64; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cublasLtMatrixLayoutOpaque_t"]
        [::std::mem::size_of::<cublasLtMatrixLayoutOpaque_t>() - 64usize];
    ["Alignment of cublasLtMatrixLayoutOpaque_t"]
        [::std::mem::align_of::<cublasLtMatrixLayoutOpaque_t>() - 8usize];
    ["Offset of field: cublasLtMatrixLayoutOpaque_t::data"]
        [::std::mem::offset_of!(cublasLtMatrixLayoutOpaque_t, data) - 0usize];
};
#[doc = " Opaque descriptor for matrix memory layout"]
pub type cublasLtMatrixLayout_t = *mut cublasLtMatrixLayoutOpaque_t;
#[doc = " Semi-opaque algorithm descriptor (to avoid complicated alloc/free schemes)\n\n This structure can be trivially serialized and later restored for use with the same version of cuBLAS library to save\n on selecting the right configuration again."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct cublasLtMatmulAlgo_t {
    pub data: [u64; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cublasLtMatmulAlgo_t"][::std::mem::size_of::<cublasLtMatmulAlgo_t>() - 64usize];
    ["Alignment of cublasLtMatmulAlgo_t"][::std::mem::align_of::<cublasLtMatmulAlgo_t>() - 8usize];
    ["Offset of field: cublasLtMatmulAlgo_t::data"]
        [::std::mem::offset_of!(cublasLtMatmulAlgo_t, data) - 0usize];
};
#[doc = " Semi-opaque descriptor for cublasLtMatmul() operation details"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct cublasLtMatmulDescOpaque_t {
    pub data: [u64; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cublasLtMatmulDescOpaque_t"]
        [::std::mem::size_of::<cublasLtMatmulDescOpaque_t>() - 256usize];
    ["Alignment of cublasLtMatmulDescOpaque_t"]
        [::std::mem::align_of::<cublasLtMatmulDescOpaque_t>() - 8usize];
    ["Offset of field: cublasLtMatmulDescOpaque_t::data"]
        [::std::mem::offset_of!(cublasLtMatmulDescOpaque_t, data) - 0usize];
};
#[doc = " Opaque descriptor for cublasLtMatmul() operation details"]
pub type cublasLtMatmulDesc_t = *mut cublasLtMatmulDescOpaque_t;
#[doc = " Semi-opaque descriptor for cublasLtMatrixTransform() operation details"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct cublasLtMatrixTransformDescOpaque_t {
    pub data: [u64; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cublasLtMatrixTransformDescOpaque_t"]
        [::std::mem::size_of::<cublasLtMatrixTransformDescOpaque_t>() - 64usize];
    ["Alignment of cublasLtMatrixTransformDescOpaque_t"]
        [::std::mem::align_of::<cublasLtMatrixTransformDescOpaque_t>() - 8usize];
    ["Offset of field: cublasLtMatrixTransformDescOpaque_t::data"]
        [::std::mem::offset_of!(cublasLtMatrixTransformDescOpaque_t, data) - 0usize];
};
#[doc = " Opaque descriptor for cublasLtMatrixTransform() operation details"]
pub type cublasLtMatrixTransformDesc_t = *mut cublasLtMatrixTransformDescOpaque_t;
#[doc = " Semi-opaque descriptor for cublasLtMatmulPreference() operation details"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct cublasLtMatmulPreferenceOpaque_t {
    pub data: [u64; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cublasLtMatmulPreferenceOpaque_t"]
        [::std::mem::size_of::<cublasLtMatmulPreferenceOpaque_t>() - 64usize];
    ["Alignment of cublasLtMatmulPreferenceOpaque_t"]
        [::std::mem::align_of::<cublasLtMatmulPreferenceOpaque_t>() - 8usize];
    ["Offset of field: cublasLtMatmulPreferenceOpaque_t::data"]
        [::std::mem::offset_of!(cublasLtMatmulPreferenceOpaque_t, data) - 0usize];
};
#[doc = " Opaque descriptor for cublasLtMatmulAlgoGetHeuristic() configuration"]
pub type cublasLtMatmulPreference_t = *mut cublasLtMatmulPreferenceOpaque_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = " Tile size (in C/D matrix Rows x Cols)\n\n General order of tile IDs is sorted by size first and by first dimension second."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatmulTile_t {
    CUBLASLT_MATMUL_TILE_UNDEFINED = 0,
    CUBLASLT_MATMUL_TILE_8x8 = 1,
    CUBLASLT_MATMUL_TILE_8x16 = 2,
    CUBLASLT_MATMUL_TILE_16x8 = 3,
    CUBLASLT_MATMUL_TILE_8x32 = 4,
    CUBLASLT_MATMUL_TILE_16x16 = 5,
    CUBLASLT_MATMUL_TILE_32x8 = 6,
    CUBLASLT_MATMUL_TILE_8x64 = 7,
    CUBLASLT_MATMUL_TILE_16x32 = 8,
    CUBLASLT_MATMUL_TILE_32x16 = 9,
    CUBLASLT_MATMUL_TILE_64x8 = 10,
    CUBLASLT_MATMUL_TILE_32x32 = 11,
    CUBLASLT_MATMUL_TILE_32x64 = 12,
    CUBLASLT_MATMUL_TILE_64x32 = 13,
    CUBLASLT_MATMUL_TILE_32x128 = 14,
    CUBLASLT_MATMUL_TILE_64x64 = 15,
    CUBLASLT_MATMUL_TILE_128x32 = 16,
    CUBLASLT_MATMUL_TILE_64x128 = 17,
    CUBLASLT_MATMUL_TILE_128x64 = 18,
    CUBLASLT_MATMUL_TILE_64x256 = 19,
    CUBLASLT_MATMUL_TILE_128x128 = 20,
    CUBLASLT_MATMUL_TILE_256x64 = 21,
    CUBLASLT_MATMUL_TILE_64x512 = 22,
    CUBLASLT_MATMUL_TILE_128x256 = 23,
    CUBLASLT_MATMUL_TILE_256x128 = 24,
    CUBLASLT_MATMUL_TILE_512x64 = 25,
    CUBLASLT_MATMUL_TILE_64x96 = 26,
    CUBLASLT_MATMUL_TILE_96x64 = 27,
    CUBLASLT_MATMUL_TILE_96x128 = 28,
    CUBLASLT_MATMUL_TILE_128x160 = 29,
    CUBLASLT_MATMUL_TILE_160x128 = 30,
    CUBLASLT_MATMUL_TILE_192x128 = 31,
    CUBLASLT_MATMUL_TILE_128x192 = 32,
    CUBLASLT_MATMUL_TILE_128x96 = 33,
    CUBLASLT_MATMUL_TILE_32x256 = 34,
    CUBLASLT_MATMUL_TILE_256x32 = 35,
    CUBLASLT_MATMUL_TILE_8x128 = 36,
    CUBLASLT_MATMUL_TILE_8x192 = 37,
    CUBLASLT_MATMUL_TILE_8x256 = 38,
    CUBLASLT_MATMUL_TILE_8x320 = 39,
    CUBLASLT_MATMUL_TILE_8x384 = 40,
    CUBLASLT_MATMUL_TILE_8x448 = 41,
    CUBLASLT_MATMUL_TILE_8x512 = 42,
    CUBLASLT_MATMUL_TILE_8x576 = 43,
    CUBLASLT_MATMUL_TILE_8x640 = 44,
    CUBLASLT_MATMUL_TILE_8x704 = 45,
    CUBLASLT_MATMUL_TILE_8x768 = 46,
    CUBLASLT_MATMUL_TILE_16x64 = 47,
    CUBLASLT_MATMUL_TILE_16x128 = 48,
    CUBLASLT_MATMUL_TILE_16x192 = 49,
    CUBLASLT_MATMUL_TILE_16x256 = 50,
    CUBLASLT_MATMUL_TILE_16x320 = 51,
    CUBLASLT_MATMUL_TILE_16x384 = 52,
    CUBLASLT_MATMUL_TILE_16x448 = 53,
    CUBLASLT_MATMUL_TILE_16x512 = 54,
    CUBLASLT_MATMUL_TILE_16x576 = 55,
    CUBLASLT_MATMUL_TILE_16x640 = 56,
    CUBLASLT_MATMUL_TILE_16x704 = 57,
    CUBLASLT_MATMUL_TILE_16x768 = 58,
    CUBLASLT_MATMUL_TILE_24x64 = 59,
    CUBLASLT_MATMUL_TILE_24x128 = 60,
    CUBLASLT_MATMUL_TILE_24x192 = 61,
    CUBLASLT_MATMUL_TILE_24x256 = 62,
    CUBLASLT_MATMUL_TILE_24x320 = 63,
    CUBLASLT_MATMUL_TILE_24x384 = 64,
    CUBLASLT_MATMUL_TILE_24x448 = 65,
    CUBLASLT_MATMUL_TILE_24x512 = 66,
    CUBLASLT_MATMUL_TILE_24x576 = 67,
    CUBLASLT_MATMUL_TILE_24x640 = 68,
    CUBLASLT_MATMUL_TILE_24x704 = 69,
    CUBLASLT_MATMUL_TILE_24x768 = 70,
    CUBLASLT_MATMUL_TILE_32x192 = 71,
    CUBLASLT_MATMUL_TILE_32x320 = 72,
    CUBLASLT_MATMUL_TILE_32x384 = 73,
    CUBLASLT_MATMUL_TILE_32x448 = 74,
    CUBLASLT_MATMUL_TILE_32x512 = 75,
    CUBLASLT_MATMUL_TILE_32x576 = 76,
    CUBLASLT_MATMUL_TILE_32x640 = 77,
    CUBLASLT_MATMUL_TILE_32x704 = 78,
    CUBLASLT_MATMUL_TILE_32x768 = 79,
    CUBLASLT_MATMUL_TILE_40x64 = 80,
    CUBLASLT_MATMUL_TILE_40x128 = 81,
    CUBLASLT_MATMUL_TILE_40x192 = 82,
    CUBLASLT_MATMUL_TILE_40x256 = 83,
    CUBLASLT_MATMUL_TILE_40x320 = 84,
    CUBLASLT_MATMUL_TILE_40x384 = 85,
    CUBLASLT_MATMUL_TILE_40x448 = 86,
    CUBLASLT_MATMUL_TILE_40x512 = 87,
    CUBLASLT_MATMUL_TILE_40x576 = 88,
    CUBLASLT_MATMUL_TILE_40x640 = 89,
    CUBLASLT_MATMUL_TILE_40x704 = 90,
    CUBLASLT_MATMUL_TILE_40x768 = 91,
    CUBLASLT_MATMUL_TILE_48x64 = 92,
    CUBLASLT_MATMUL_TILE_48x128 = 93,
    CUBLASLT_MATMUL_TILE_48x192 = 94,
    CUBLASLT_MATMUL_TILE_48x256 = 95,
    CUBLASLT_MATMUL_TILE_48x320 = 96,
    CUBLASLT_MATMUL_TILE_48x384 = 97,
    CUBLASLT_MATMUL_TILE_48x448 = 98,
    CUBLASLT_MATMUL_TILE_48x512 = 99,
    CUBLASLT_MATMUL_TILE_48x576 = 100,
    CUBLASLT_MATMUL_TILE_48x640 = 101,
    CUBLASLT_MATMUL_TILE_48x704 = 102,
    CUBLASLT_MATMUL_TILE_48x768 = 103,
    CUBLASLT_MATMUL_TILE_56x64 = 104,
    CUBLASLT_MATMUL_TILE_56x128 = 105,
    CUBLASLT_MATMUL_TILE_56x192 = 106,
    CUBLASLT_MATMUL_TILE_56x256 = 107,
    CUBLASLT_MATMUL_TILE_56x320 = 108,
    CUBLASLT_MATMUL_TILE_56x384 = 109,
    CUBLASLT_MATMUL_TILE_56x448 = 110,
    CUBLASLT_MATMUL_TILE_56x512 = 111,
    CUBLASLT_MATMUL_TILE_56x576 = 112,
    CUBLASLT_MATMUL_TILE_56x640 = 113,
    CUBLASLT_MATMUL_TILE_56x704 = 114,
    CUBLASLT_MATMUL_TILE_56x768 = 115,
    CUBLASLT_MATMUL_TILE_64x192 = 116,
    CUBLASLT_MATMUL_TILE_64x320 = 117,
    CUBLASLT_MATMUL_TILE_64x384 = 118,
    CUBLASLT_MATMUL_TILE_64x448 = 119,
    CUBLASLT_MATMUL_TILE_64x576 = 120,
    CUBLASLT_MATMUL_TILE_64x640 = 121,
    CUBLASLT_MATMUL_TILE_64x704 = 122,
    CUBLASLT_MATMUL_TILE_64x768 = 123,
    CUBLASLT_MATMUL_TILE_72x64 = 124,
    CUBLASLT_MATMUL_TILE_72x128 = 125,
    CUBLASLT_MATMUL_TILE_72x192 = 126,
    CUBLASLT_MATMUL_TILE_72x256 = 127,
    CUBLASLT_MATMUL_TILE_72x320 = 128,
    CUBLASLT_MATMUL_TILE_72x384 = 129,
    CUBLASLT_MATMUL_TILE_72x448 = 130,
    CUBLASLT_MATMUL_TILE_72x512 = 131,
    CUBLASLT_MATMUL_TILE_72x576 = 132,
    CUBLASLT_MATMUL_TILE_72x640 = 133,
    CUBLASLT_MATMUL_TILE_80x64 = 134,
    CUBLASLT_MATMUL_TILE_80x128 = 135,
    CUBLASLT_MATMUL_TILE_80x192 = 136,
    CUBLASLT_MATMUL_TILE_80x256 = 137,
    CUBLASLT_MATMUL_TILE_80x320 = 138,
    CUBLASLT_MATMUL_TILE_80x384 = 139,
    CUBLASLT_MATMUL_TILE_80x448 = 140,
    CUBLASLT_MATMUL_TILE_80x512 = 141,
    CUBLASLT_MATMUL_TILE_80x576 = 142,
    CUBLASLT_MATMUL_TILE_88x64 = 143,
    CUBLASLT_MATMUL_TILE_88x128 = 144,
    CUBLASLT_MATMUL_TILE_88x192 = 145,
    CUBLASLT_MATMUL_TILE_88x256 = 146,
    CUBLASLT_MATMUL_TILE_88x320 = 147,
    CUBLASLT_MATMUL_TILE_88x384 = 148,
    CUBLASLT_MATMUL_TILE_88x448 = 149,
    CUBLASLT_MATMUL_TILE_88x512 = 150,
    CUBLASLT_MATMUL_TILE_96x192 = 151,
    CUBLASLT_MATMUL_TILE_96x256 = 152,
    CUBLASLT_MATMUL_TILE_96x320 = 153,
    CUBLASLT_MATMUL_TILE_96x384 = 154,
    CUBLASLT_MATMUL_TILE_96x448 = 155,
    CUBLASLT_MATMUL_TILE_96x512 = 156,
    CUBLASLT_MATMUL_TILE_104x64 = 157,
    CUBLASLT_MATMUL_TILE_104x128 = 158,
    CUBLASLT_MATMUL_TILE_104x192 = 159,
    CUBLASLT_MATMUL_TILE_104x256 = 160,
    CUBLASLT_MATMUL_TILE_104x320 = 161,
    CUBLASLT_MATMUL_TILE_104x384 = 162,
    CUBLASLT_MATMUL_TILE_104x448 = 163,
    CUBLASLT_MATMUL_TILE_112x64 = 164,
    CUBLASLT_MATMUL_TILE_112x128 = 165,
    CUBLASLT_MATMUL_TILE_112x192 = 166,
    CUBLASLT_MATMUL_TILE_112x256 = 167,
    CUBLASLT_MATMUL_TILE_112x320 = 168,
    CUBLASLT_MATMUL_TILE_112x384 = 169,
    CUBLASLT_MATMUL_TILE_120x64 = 170,
    CUBLASLT_MATMUL_TILE_120x128 = 171,
    CUBLASLT_MATMUL_TILE_120x192 = 172,
    CUBLASLT_MATMUL_TILE_120x256 = 173,
    CUBLASLT_MATMUL_TILE_120x320 = 174,
    CUBLASLT_MATMUL_TILE_120x384 = 175,
    CUBLASLT_MATMUL_TILE_128x320 = 176,
    CUBLASLT_MATMUL_TILE_128x384 = 177,
    CUBLASLT_MATMUL_TILE_136x64 = 178,
    CUBLASLT_MATMUL_TILE_136x128 = 179,
    CUBLASLT_MATMUL_TILE_136x192 = 180,
    CUBLASLT_MATMUL_TILE_136x256 = 181,
    CUBLASLT_MATMUL_TILE_136x320 = 182,
    CUBLASLT_MATMUL_TILE_144x64 = 183,
    CUBLASLT_MATMUL_TILE_144x128 = 184,
    CUBLASLT_MATMUL_TILE_144x192 = 185,
    CUBLASLT_MATMUL_TILE_144x256 = 186,
    CUBLASLT_MATMUL_TILE_144x320 = 187,
    CUBLASLT_MATMUL_TILE_152x64 = 188,
    CUBLASLT_MATMUL_TILE_152x128 = 189,
    CUBLASLT_MATMUL_TILE_152x192 = 190,
    CUBLASLT_MATMUL_TILE_152x256 = 191,
    CUBLASLT_MATMUL_TILE_152x320 = 192,
    CUBLASLT_MATMUL_TILE_160x64 = 193,
    CUBLASLT_MATMUL_TILE_160x192 = 194,
    CUBLASLT_MATMUL_TILE_160x256 = 195,
    CUBLASLT_MATMUL_TILE_168x64 = 196,
    CUBLASLT_MATMUL_TILE_168x128 = 197,
    CUBLASLT_MATMUL_TILE_168x192 = 198,
    CUBLASLT_MATMUL_TILE_168x256 = 199,
    CUBLASLT_MATMUL_TILE_176x64 = 200,
    CUBLASLT_MATMUL_TILE_176x128 = 201,
    CUBLASLT_MATMUL_TILE_176x192 = 202,
    CUBLASLT_MATMUL_TILE_176x256 = 203,
    CUBLASLT_MATMUL_TILE_184x64 = 204,
    CUBLASLT_MATMUL_TILE_184x128 = 205,
    CUBLASLT_MATMUL_TILE_184x192 = 206,
    CUBLASLT_MATMUL_TILE_184x256 = 207,
    CUBLASLT_MATMUL_TILE_192x64 = 208,
    CUBLASLT_MATMUL_TILE_192x192 = 209,
    CUBLASLT_MATMUL_TILE_192x256 = 210,
    CUBLASLT_MATMUL_TILE_200x64 = 211,
    CUBLASLT_MATMUL_TILE_200x128 = 212,
    CUBLASLT_MATMUL_TILE_200x192 = 213,
    CUBLASLT_MATMUL_TILE_208x64 = 214,
    CUBLASLT_MATMUL_TILE_208x128 = 215,
    CUBLASLT_MATMUL_TILE_208x192 = 216,
    CUBLASLT_MATMUL_TILE_216x64 = 217,
    CUBLASLT_MATMUL_TILE_216x128 = 218,
    CUBLASLT_MATMUL_TILE_216x192 = 219,
    CUBLASLT_MATMUL_TILE_224x64 = 220,
    CUBLASLT_MATMUL_TILE_224x128 = 221,
    CUBLASLT_MATMUL_TILE_224x192 = 222,
    CUBLASLT_MATMUL_TILE_232x64 = 223,
    CUBLASLT_MATMUL_TILE_232x128 = 224,
    CUBLASLT_MATMUL_TILE_232x192 = 225,
    CUBLASLT_MATMUL_TILE_240x64 = 226,
    CUBLASLT_MATMUL_TILE_240x128 = 227,
    CUBLASLT_MATMUL_TILE_240x192 = 228,
    CUBLASLT_MATMUL_TILE_248x64 = 229,
    CUBLASLT_MATMUL_TILE_248x128 = 230,
    CUBLASLT_MATMUL_TILE_248x192 = 231,
    CUBLASLT_MATMUL_TILE_256x192 = 232,
    CUBLASLT_MATMUL_TILE_264x64 = 233,
    CUBLASLT_MATMUL_TILE_264x128 = 234,
    CUBLASLT_MATMUL_TILE_272x64 = 235,
    CUBLASLT_MATMUL_TILE_272x128 = 236,
    CUBLASLT_MATMUL_TILE_280x64 = 237,
    CUBLASLT_MATMUL_TILE_280x128 = 238,
    CUBLASLT_MATMUL_TILE_288x64 = 239,
    CUBLASLT_MATMUL_TILE_288x128 = 240,
    CUBLASLT_MATMUL_TILE_296x64 = 241,
    CUBLASLT_MATMUL_TILE_296x128 = 242,
    CUBLASLT_MATMUL_TILE_304x64 = 243,
    CUBLASLT_MATMUL_TILE_304x128 = 244,
    CUBLASLT_MATMUL_TILE_312x64 = 245,
    CUBLASLT_MATMUL_TILE_312x128 = 246,
    CUBLASLT_MATMUL_TILE_320x64 = 247,
    CUBLASLT_MATMUL_TILE_320x128 = 248,
    CUBLASLT_MATMUL_TILE_328x64 = 249,
    CUBLASLT_MATMUL_TILE_328x128 = 250,
    CUBLASLT_MATMUL_TILE_336x64 = 251,
    CUBLASLT_MATMUL_TILE_336x128 = 252,
    CUBLASLT_MATMUL_TILE_344x64 = 253,
    CUBLASLT_MATMUL_TILE_344x128 = 254,
    CUBLASLT_MATMUL_TILE_352x64 = 255,
    CUBLASLT_MATMUL_TILE_352x128 = 256,
    CUBLASLT_MATMUL_TILE_360x64 = 257,
    CUBLASLT_MATMUL_TILE_360x128 = 258,
    CUBLASLT_MATMUL_TILE_368x64 = 259,
    CUBLASLT_MATMUL_TILE_368x128 = 260,
    CUBLASLT_MATMUL_TILE_376x64 = 261,
    CUBLASLT_MATMUL_TILE_376x128 = 262,
    CUBLASLT_MATMUL_TILE_384x64 = 263,
    CUBLASLT_MATMUL_TILE_384x128 = 264,
    CUBLASLT_MATMUL_TILE_392x64 = 265,
    CUBLASLT_MATMUL_TILE_400x64 = 266,
    CUBLASLT_MATMUL_TILE_408x64 = 267,
    CUBLASLT_MATMUL_TILE_416x64 = 268,
    CUBLASLT_MATMUL_TILE_424x64 = 269,
    CUBLASLT_MATMUL_TILE_432x64 = 270,
    CUBLASLT_MATMUL_TILE_440x64 = 271,
    CUBLASLT_MATMUL_TILE_448x64 = 272,
    CUBLASLT_MATMUL_TILE_456x64 = 273,
    CUBLASLT_MATMUL_TILE_464x64 = 274,
    CUBLASLT_MATMUL_TILE_472x64 = 275,
    CUBLASLT_MATMUL_TILE_480x64 = 276,
    CUBLASLT_MATMUL_TILE_488x64 = 277,
    CUBLASLT_MATMUL_TILE_496x64 = 278,
    CUBLASLT_MATMUL_TILE_504x64 = 279,
    CUBLASLT_MATMUL_TILE_520x64 = 280,
    CUBLASLT_MATMUL_TILE_528x64 = 281,
    CUBLASLT_MATMUL_TILE_536x64 = 282,
    CUBLASLT_MATMUL_TILE_544x64 = 283,
    CUBLASLT_MATMUL_TILE_552x64 = 284,
    CUBLASLT_MATMUL_TILE_560x64 = 285,
    CUBLASLT_MATMUL_TILE_568x64 = 286,
    CUBLASLT_MATMUL_TILE_576x64 = 287,
    CUBLASLT_MATMUL_TILE_584x64 = 288,
    CUBLASLT_MATMUL_TILE_592x64 = 289,
    CUBLASLT_MATMUL_TILE_600x64 = 290,
    CUBLASLT_MATMUL_TILE_608x64 = 291,
    CUBLASLT_MATMUL_TILE_616x64 = 292,
    CUBLASLT_MATMUL_TILE_624x64 = 293,
    CUBLASLT_MATMUL_TILE_632x64 = 294,
    CUBLASLT_MATMUL_TILE_640x64 = 295,
    CUBLASLT_MATMUL_TILE_648x64 = 296,
    CUBLASLT_MATMUL_TILE_656x64 = 297,
    CUBLASLT_MATMUL_TILE_664x64 = 298,
    CUBLASLT_MATMUL_TILE_672x64 = 299,
    CUBLASLT_MATMUL_TILE_680x64 = 300,
    CUBLASLT_MATMUL_TILE_688x64 = 301,
    CUBLASLT_MATMUL_TILE_696x64 = 302,
    CUBLASLT_MATMUL_TILE_704x64 = 303,
    CUBLASLT_MATMUL_TILE_712x64 = 304,
    CUBLASLT_MATMUL_TILE_720x64 = 305,
    CUBLASLT_MATMUL_TILE_728x64 = 306,
    CUBLASLT_MATMUL_TILE_736x64 = 307,
    CUBLASLT_MATMUL_TILE_744x64 = 308,
    CUBLASLT_MATMUL_TILE_752x64 = 309,
    CUBLASLT_MATMUL_TILE_760x64 = 310,
    CUBLASLT_MATMUL_TILE_768x64 = 311,
    CUBLASLT_MATMUL_TILE_64x16 = 312,
    CUBLASLT_MATMUL_TILE_64x24 = 313,
    CUBLASLT_MATMUL_TILE_64x40 = 314,
    CUBLASLT_MATMUL_TILE_64x48 = 315,
    CUBLASLT_MATMUL_TILE_64x56 = 316,
    CUBLASLT_MATMUL_TILE_64x72 = 317,
    CUBLASLT_MATMUL_TILE_64x80 = 318,
    CUBLASLT_MATMUL_TILE_64x88 = 319,
    CUBLASLT_MATMUL_TILE_64x104 = 320,
    CUBLASLT_MATMUL_TILE_64x112 = 321,
    CUBLASLT_MATMUL_TILE_64x120 = 322,
    CUBLASLT_MATMUL_TILE_64x136 = 323,
    CUBLASLT_MATMUL_TILE_64x144 = 324,
    CUBLASLT_MATMUL_TILE_64x152 = 325,
    CUBLASLT_MATMUL_TILE_64x160 = 326,
    CUBLASLT_MATMUL_TILE_64x168 = 327,
    CUBLASLT_MATMUL_TILE_64x176 = 328,
    CUBLASLT_MATMUL_TILE_64x184 = 329,
    CUBLASLT_MATMUL_TILE_64x200 = 330,
    CUBLASLT_MATMUL_TILE_64x208 = 331,
    CUBLASLT_MATMUL_TILE_64x216 = 332,
    CUBLASLT_MATMUL_TILE_64x224 = 333,
    CUBLASLT_MATMUL_TILE_64x232 = 334,
    CUBLASLT_MATMUL_TILE_64x240 = 335,
    CUBLASLT_MATMUL_TILE_64x248 = 336,
    CUBLASLT_MATMUL_TILE_64x264 = 337,
    CUBLASLT_MATMUL_TILE_64x272 = 338,
    CUBLASLT_MATMUL_TILE_64x280 = 339,
    CUBLASLT_MATMUL_TILE_64x288 = 340,
    CUBLASLT_MATMUL_TILE_64x296 = 341,
    CUBLASLT_MATMUL_TILE_64x304 = 342,
    CUBLASLT_MATMUL_TILE_64x312 = 343,
    CUBLASLT_MATMUL_TILE_64x328 = 344,
    CUBLASLT_MATMUL_TILE_64x336 = 345,
    CUBLASLT_MATMUL_TILE_64x344 = 346,
    CUBLASLT_MATMUL_TILE_64x352 = 347,
    CUBLASLT_MATMUL_TILE_64x360 = 348,
    CUBLASLT_MATMUL_TILE_64x368 = 349,
    CUBLASLT_MATMUL_TILE_64x376 = 350,
    CUBLASLT_MATMUL_TILE_64x392 = 351,
    CUBLASLT_MATMUL_TILE_64x400 = 352,
    CUBLASLT_MATMUL_TILE_64x408 = 353,
    CUBLASLT_MATMUL_TILE_64x416 = 354,
    CUBLASLT_MATMUL_TILE_64x424 = 355,
    CUBLASLT_MATMUL_TILE_64x432 = 356,
    CUBLASLT_MATMUL_TILE_64x440 = 357,
    CUBLASLT_MATMUL_TILE_64x456 = 358,
    CUBLASLT_MATMUL_TILE_64x464 = 359,
    CUBLASLT_MATMUL_TILE_64x472 = 360,
    CUBLASLT_MATMUL_TILE_64x480 = 361,
    CUBLASLT_MATMUL_TILE_64x488 = 362,
    CUBLASLT_MATMUL_TILE_64x496 = 363,
    CUBLASLT_MATMUL_TILE_64x504 = 364,
    CUBLASLT_MATMUL_TILE_64x520 = 365,
    CUBLASLT_MATMUL_TILE_64x528 = 366,
    CUBLASLT_MATMUL_TILE_64x536 = 367,
    CUBLASLT_MATMUL_TILE_64x544 = 368,
    CUBLASLT_MATMUL_TILE_64x552 = 369,
    CUBLASLT_MATMUL_TILE_64x560 = 370,
    CUBLASLT_MATMUL_TILE_64x568 = 371,
    CUBLASLT_MATMUL_TILE_64x584 = 372,
    CUBLASLT_MATMUL_TILE_64x592 = 373,
    CUBLASLT_MATMUL_TILE_64x600 = 374,
    CUBLASLT_MATMUL_TILE_64x608 = 375,
    CUBLASLT_MATMUL_TILE_64x616 = 376,
    CUBLASLT_MATMUL_TILE_64x624 = 377,
    CUBLASLT_MATMUL_TILE_64x632 = 378,
    CUBLASLT_MATMUL_TILE_64x648 = 379,
    CUBLASLT_MATMUL_TILE_64x656 = 380,
    CUBLASLT_MATMUL_TILE_64x664 = 381,
    CUBLASLT_MATMUL_TILE_64x672 = 382,
    CUBLASLT_MATMUL_TILE_64x680 = 383,
    CUBLASLT_MATMUL_TILE_64x688 = 384,
    CUBLASLT_MATMUL_TILE_64x696 = 385,
    CUBLASLT_MATMUL_TILE_64x712 = 386,
    CUBLASLT_MATMUL_TILE_64x720 = 387,
    CUBLASLT_MATMUL_TILE_64x728 = 388,
    CUBLASLT_MATMUL_TILE_64x736 = 389,
    CUBLASLT_MATMUL_TILE_64x744 = 390,
    CUBLASLT_MATMUL_TILE_64x752 = 391,
    CUBLASLT_MATMUL_TILE_64x760 = 392,
    CUBLASLT_MATMUL_TILE_128x8 = 393,
    CUBLASLT_MATMUL_TILE_128x16 = 394,
    CUBLASLT_MATMUL_TILE_128x24 = 395,
    CUBLASLT_MATMUL_TILE_128x40 = 396,
    CUBLASLT_MATMUL_TILE_128x48 = 397,
    CUBLASLT_MATMUL_TILE_128x56 = 398,
    CUBLASLT_MATMUL_TILE_128x72 = 399,
    CUBLASLT_MATMUL_TILE_128x80 = 400,
    CUBLASLT_MATMUL_TILE_128x88 = 401,
    CUBLASLT_MATMUL_TILE_128x104 = 402,
    CUBLASLT_MATMUL_TILE_128x112 = 403,
    CUBLASLT_MATMUL_TILE_128x120 = 404,
    CUBLASLT_MATMUL_TILE_128x136 = 405,
    CUBLASLT_MATMUL_TILE_128x144 = 406,
    CUBLASLT_MATMUL_TILE_128x152 = 407,
    CUBLASLT_MATMUL_TILE_128x168 = 408,
    CUBLASLT_MATMUL_TILE_128x176 = 409,
    CUBLASLT_MATMUL_TILE_128x184 = 410,
    CUBLASLT_MATMUL_TILE_128x200 = 411,
    CUBLASLT_MATMUL_TILE_128x208 = 412,
    CUBLASLT_MATMUL_TILE_128x216 = 413,
    CUBLASLT_MATMUL_TILE_128x224 = 414,
    CUBLASLT_MATMUL_TILE_128x232 = 415,
    CUBLASLT_MATMUL_TILE_128x240 = 416,
    CUBLASLT_MATMUL_TILE_128x248 = 417,
    CUBLASLT_MATMUL_TILE_128x264 = 418,
    CUBLASLT_MATMUL_TILE_128x272 = 419,
    CUBLASLT_MATMUL_TILE_128x280 = 420,
    CUBLASLT_MATMUL_TILE_128x288 = 421,
    CUBLASLT_MATMUL_TILE_128x296 = 422,
    CUBLASLT_MATMUL_TILE_128x304 = 423,
    CUBLASLT_MATMUL_TILE_128x312 = 424,
    CUBLASLT_MATMUL_TILE_128x328 = 425,
    CUBLASLT_MATMUL_TILE_128x336 = 426,
    CUBLASLT_MATMUL_TILE_128x344 = 427,
    CUBLASLT_MATMUL_TILE_128x352 = 428,
    CUBLASLT_MATMUL_TILE_128x360 = 429,
    CUBLASLT_MATMUL_TILE_128x368 = 430,
    CUBLASLT_MATMUL_TILE_128x376 = 431,
    CUBLASLT_MATMUL_TILE_128x392 = 432,
    CUBLASLT_MATMUL_TILE_128x400 = 433,
    CUBLASLT_MATMUL_TILE_128x408 = 434,
    CUBLASLT_MATMUL_TILE_128x416 = 435,
    CUBLASLT_MATMUL_TILE_128x424 = 436,
    CUBLASLT_MATMUL_TILE_128x432 = 437,
    CUBLASLT_MATMUL_TILE_128x440 = 438,
    CUBLASLT_MATMUL_TILE_128x448 = 439,
    CUBLASLT_MATMUL_TILE_128x456 = 440,
    CUBLASLT_MATMUL_TILE_128x464 = 441,
    CUBLASLT_MATMUL_TILE_128x472 = 442,
    CUBLASLT_MATMUL_TILE_128x480 = 443,
    CUBLASLT_MATMUL_TILE_128x488 = 444,
    CUBLASLT_MATMUL_TILE_128x496 = 445,
    CUBLASLT_MATMUL_TILE_128x504 = 446,
    CUBLASLT_MATMUL_TILE_128x512 = 447,
    CUBLASLT_MATMUL_TILE_192x8 = 448,
    CUBLASLT_MATMUL_TILE_192x16 = 449,
    CUBLASLT_MATMUL_TILE_192x24 = 450,
    CUBLASLT_MATMUL_TILE_192x32 = 451,
    CUBLASLT_MATMUL_TILE_192x40 = 452,
    CUBLASLT_MATMUL_TILE_192x48 = 453,
    CUBLASLT_MATMUL_TILE_192x56 = 454,
    CUBLASLT_MATMUL_TILE_192x72 = 455,
    CUBLASLT_MATMUL_TILE_192x80 = 456,
    CUBLASLT_MATMUL_TILE_192x88 = 457,
    CUBLASLT_MATMUL_TILE_192x96 = 458,
    CUBLASLT_MATMUL_TILE_192x104 = 459,
    CUBLASLT_MATMUL_TILE_192x112 = 460,
    CUBLASLT_MATMUL_TILE_192x120 = 461,
    CUBLASLT_MATMUL_TILE_192x136 = 462,
    CUBLASLT_MATMUL_TILE_192x144 = 463,
    CUBLASLT_MATMUL_TILE_192x152 = 464,
    CUBLASLT_MATMUL_TILE_192x160 = 465,
    CUBLASLT_MATMUL_TILE_192x168 = 466,
    CUBLASLT_MATMUL_TILE_192x176 = 467,
    CUBLASLT_MATMUL_TILE_192x184 = 468,
    CUBLASLT_MATMUL_TILE_192x200 = 469,
    CUBLASLT_MATMUL_TILE_192x208 = 470,
    CUBLASLT_MATMUL_TILE_192x216 = 471,
    CUBLASLT_MATMUL_TILE_192x224 = 472,
    CUBLASLT_MATMUL_TILE_192x232 = 473,
    CUBLASLT_MATMUL_TILE_192x240 = 474,
    CUBLASLT_MATMUL_TILE_192x248 = 475,
    CUBLASLT_MATMUL_TILE_192x264 = 476,
    CUBLASLT_MATMUL_TILE_192x272 = 477,
    CUBLASLT_MATMUL_TILE_192x280 = 478,
    CUBLASLT_MATMUL_TILE_192x288 = 479,
    CUBLASLT_MATMUL_TILE_192x296 = 480,
    CUBLASLT_MATMUL_TILE_192x304 = 481,
    CUBLASLT_MATMUL_TILE_192x312 = 482,
    CUBLASLT_MATMUL_TILE_192x320 = 483,
    CUBLASLT_MATMUL_TILE_192x328 = 484,
    CUBLASLT_MATMUL_TILE_192x336 = 485,
    CUBLASLT_MATMUL_TILE_256x8 = 486,
    CUBLASLT_MATMUL_TILE_256x16 = 487,
    CUBLASLT_MATMUL_TILE_256x24 = 488,
    CUBLASLT_MATMUL_TILE_256x40 = 489,
    CUBLASLT_MATMUL_TILE_256x48 = 490,
    CUBLASLT_MATMUL_TILE_256x56 = 491,
    CUBLASLT_MATMUL_TILE_256x72 = 492,
    CUBLASLT_MATMUL_TILE_256x80 = 493,
    CUBLASLT_MATMUL_TILE_256x88 = 494,
    CUBLASLT_MATMUL_TILE_256x96 = 495,
    CUBLASLT_MATMUL_TILE_256x104 = 496,
    CUBLASLT_MATMUL_TILE_256x112 = 497,
    CUBLASLT_MATMUL_TILE_256x120 = 498,
    CUBLASLT_MATMUL_TILE_256x136 = 499,
    CUBLASLT_MATMUL_TILE_256x144 = 500,
    CUBLASLT_MATMUL_TILE_256x152 = 501,
    CUBLASLT_MATMUL_TILE_256x160 = 502,
    CUBLASLT_MATMUL_TILE_256x168 = 503,
    CUBLASLT_MATMUL_TILE_256x176 = 504,
    CUBLASLT_MATMUL_TILE_256x184 = 505,
    CUBLASLT_MATMUL_TILE_256x200 = 506,
    CUBLASLT_MATMUL_TILE_256x208 = 507,
    CUBLASLT_MATMUL_TILE_256x216 = 508,
    CUBLASLT_MATMUL_TILE_256x224 = 509,
    CUBLASLT_MATMUL_TILE_256x232 = 510,
    CUBLASLT_MATMUL_TILE_256x240 = 511,
    CUBLASLT_MATMUL_TILE_256x248 = 512,
    CUBLASLT_MATMUL_TILE_256x256 = 513,
    CUBLASLT_MATMUL_TILE_320x8 = 514,
    CUBLASLT_MATMUL_TILE_320x16 = 515,
    CUBLASLT_MATMUL_TILE_320x24 = 516,
    CUBLASLT_MATMUL_TILE_320x32 = 517,
    CUBLASLT_MATMUL_TILE_320x40 = 518,
    CUBLASLT_MATMUL_TILE_320x48 = 519,
    CUBLASLT_MATMUL_TILE_320x56 = 520,
    CUBLASLT_MATMUL_TILE_320x72 = 521,
    CUBLASLT_MATMUL_TILE_320x80 = 522,
    CUBLASLT_MATMUL_TILE_320x88 = 523,
    CUBLASLT_MATMUL_TILE_320x96 = 524,
    CUBLASLT_MATMUL_TILE_320x104 = 525,
    CUBLASLT_MATMUL_TILE_320x112 = 526,
    CUBLASLT_MATMUL_TILE_320x120 = 527,
    CUBLASLT_MATMUL_TILE_320x136 = 528,
    CUBLASLT_MATMUL_TILE_320x144 = 529,
    CUBLASLT_MATMUL_TILE_320x152 = 530,
    CUBLASLT_MATMUL_TILE_320x160 = 531,
    CUBLASLT_MATMUL_TILE_320x168 = 532,
    CUBLASLT_MATMUL_TILE_320x176 = 533,
    CUBLASLT_MATMUL_TILE_320x184 = 534,
    CUBLASLT_MATMUL_TILE_320x192 = 535,
    CUBLASLT_MATMUL_TILE_320x200 = 536,
    CUBLASLT_MATMUL_TILE_384x8 = 537,
    CUBLASLT_MATMUL_TILE_384x16 = 538,
    CUBLASLT_MATMUL_TILE_384x24 = 539,
    CUBLASLT_MATMUL_TILE_384x32 = 540,
    CUBLASLT_MATMUL_TILE_384x40 = 541,
    CUBLASLT_MATMUL_TILE_384x48 = 542,
    CUBLASLT_MATMUL_TILE_384x56 = 543,
    CUBLASLT_MATMUL_TILE_384x72 = 544,
    CUBLASLT_MATMUL_TILE_384x80 = 545,
    CUBLASLT_MATMUL_TILE_384x88 = 546,
    CUBLASLT_MATMUL_TILE_384x96 = 547,
    CUBLASLT_MATMUL_TILE_384x104 = 548,
    CUBLASLT_MATMUL_TILE_384x112 = 549,
    CUBLASLT_MATMUL_TILE_384x120 = 550,
    CUBLASLT_MATMUL_TILE_384x136 = 551,
    CUBLASLT_MATMUL_TILE_384x144 = 552,
    CUBLASLT_MATMUL_TILE_384x152 = 553,
    CUBLASLT_MATMUL_TILE_384x160 = 554,
    CUBLASLT_MATMUL_TILE_384x168 = 555,
    CUBLASLT_MATMUL_TILE_448x8 = 556,
    CUBLASLT_MATMUL_TILE_448x16 = 557,
    CUBLASLT_MATMUL_TILE_448x24 = 558,
    CUBLASLT_MATMUL_TILE_448x32 = 559,
    CUBLASLT_MATMUL_TILE_448x40 = 560,
    CUBLASLT_MATMUL_TILE_448x48 = 561,
    CUBLASLT_MATMUL_TILE_448x56 = 562,
    CUBLASLT_MATMUL_TILE_448x72 = 563,
    CUBLASLT_MATMUL_TILE_448x80 = 564,
    CUBLASLT_MATMUL_TILE_448x88 = 565,
    CUBLASLT_MATMUL_TILE_448x96 = 566,
    CUBLASLT_MATMUL_TILE_448x104 = 567,
    CUBLASLT_MATMUL_TILE_448x112 = 568,
    CUBLASLT_MATMUL_TILE_448x120 = 569,
    CUBLASLT_MATMUL_TILE_448x128 = 570,
    CUBLASLT_MATMUL_TILE_448x136 = 571,
    CUBLASLT_MATMUL_TILE_448x144 = 572,
    CUBLASLT_MATMUL_TILE_512x8 = 573,
    CUBLASLT_MATMUL_TILE_512x16 = 574,
    CUBLASLT_MATMUL_TILE_512x24 = 575,
    CUBLASLT_MATMUL_TILE_512x32 = 576,
    CUBLASLT_MATMUL_TILE_512x40 = 577,
    CUBLASLT_MATMUL_TILE_512x48 = 578,
    CUBLASLT_MATMUL_TILE_512x56 = 579,
    CUBLASLT_MATMUL_TILE_512x72 = 580,
    CUBLASLT_MATMUL_TILE_512x80 = 581,
    CUBLASLT_MATMUL_TILE_512x88 = 582,
    CUBLASLT_MATMUL_TILE_512x96 = 583,
    CUBLASLT_MATMUL_TILE_512x104 = 584,
    CUBLASLT_MATMUL_TILE_512x112 = 585,
    CUBLASLT_MATMUL_TILE_512x120 = 586,
    CUBLASLT_MATMUL_TILE_512x128 = 587,
    CUBLASLT_MATMUL_TILE_576x8 = 588,
    CUBLASLT_MATMUL_TILE_576x16 = 589,
    CUBLASLT_MATMUL_TILE_576x24 = 590,
    CUBLASLT_MATMUL_TILE_576x32 = 591,
    CUBLASLT_MATMUL_TILE_576x40 = 592,
    CUBLASLT_MATMUL_TILE_576x48 = 593,
    CUBLASLT_MATMUL_TILE_576x56 = 594,
    CUBLASLT_MATMUL_TILE_576x72 = 595,
    CUBLASLT_MATMUL_TILE_576x80 = 596,
    CUBLASLT_MATMUL_TILE_576x88 = 597,
    CUBLASLT_MATMUL_TILE_576x96 = 598,
    CUBLASLT_MATMUL_TILE_576x104 = 599,
    CUBLASLT_MATMUL_TILE_576x112 = 600,
    CUBLASLT_MATMUL_TILE_640x8 = 601,
    CUBLASLT_MATMUL_TILE_640x16 = 602,
    CUBLASLT_MATMUL_TILE_640x24 = 603,
    CUBLASLT_MATMUL_TILE_640x32 = 604,
    CUBLASLT_MATMUL_TILE_640x40 = 605,
    CUBLASLT_MATMUL_TILE_640x48 = 606,
    CUBLASLT_MATMUL_TILE_640x56 = 607,
    CUBLASLT_MATMUL_TILE_640x72 = 608,
    CUBLASLT_MATMUL_TILE_640x80 = 609,
    CUBLASLT_MATMUL_TILE_640x88 = 610,
    CUBLASLT_MATMUL_TILE_640x96 = 611,
    CUBLASLT_MATMUL_TILE_704x8 = 612,
    CUBLASLT_MATMUL_TILE_704x16 = 613,
    CUBLASLT_MATMUL_TILE_704x24 = 614,
    CUBLASLT_MATMUL_TILE_704x32 = 615,
    CUBLASLT_MATMUL_TILE_704x40 = 616,
    CUBLASLT_MATMUL_TILE_704x48 = 617,
    CUBLASLT_MATMUL_TILE_704x56 = 618,
    CUBLASLT_MATMUL_TILE_704x72 = 619,
    CUBLASLT_MATMUL_TILE_704x80 = 620,
    CUBLASLT_MATMUL_TILE_704x88 = 621,
    CUBLASLT_MATMUL_TILE_768x8 = 622,
    CUBLASLT_MATMUL_TILE_768x16 = 623,
    CUBLASLT_MATMUL_TILE_768x24 = 624,
    CUBLASLT_MATMUL_TILE_768x32 = 625,
    CUBLASLT_MATMUL_TILE_768x40 = 626,
    CUBLASLT_MATMUL_TILE_768x48 = 627,
    CUBLASLT_MATMUL_TILE_768x56 = 628,
    CUBLASLT_MATMUL_TILE_768x72 = 629,
    CUBLASLT_MATMUL_TILE_768x80 = 630,
    CUBLASLT_MATMUL_TILE_256x512 = 631,
    CUBLASLT_MATMUL_TILE_256x1024 = 632,
    CUBLASLT_MATMUL_TILE_512x512 = 633,
    CUBLASLT_MATMUL_TILE_512x1024 = 634,
    CUBLASLT_MATMUL_TILE_END = 635,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Size and number of stages in which elements are read into shared memory\n\n General order of stages IDs is sorted by stage size first and by number of stages second."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatmulStages_t {
    CUBLASLT_MATMUL_STAGES_UNDEFINED = 0,
    CUBLASLT_MATMUL_STAGES_16x1 = 1,
    CUBLASLT_MATMUL_STAGES_16x2 = 2,
    CUBLASLT_MATMUL_STAGES_16x3 = 3,
    CUBLASLT_MATMUL_STAGES_16x4 = 4,
    CUBLASLT_MATMUL_STAGES_16x5 = 5,
    CUBLASLT_MATMUL_STAGES_16x6 = 6,
    CUBLASLT_MATMUL_STAGES_32x1 = 7,
    CUBLASLT_MATMUL_STAGES_32x2 = 8,
    CUBLASLT_MATMUL_STAGES_32x3 = 9,
    CUBLASLT_MATMUL_STAGES_32x4 = 10,
    CUBLASLT_MATMUL_STAGES_32x5 = 11,
    CUBLASLT_MATMUL_STAGES_32x6 = 12,
    CUBLASLT_MATMUL_STAGES_64x1 = 13,
    CUBLASLT_MATMUL_STAGES_64x2 = 14,
    CUBLASLT_MATMUL_STAGES_64x3 = 15,
    CUBLASLT_MATMUL_STAGES_64x4 = 16,
    CUBLASLT_MATMUL_STAGES_64x5 = 17,
    CUBLASLT_MATMUL_STAGES_64x6 = 18,
    CUBLASLT_MATMUL_STAGES_128x1 = 19,
    CUBLASLT_MATMUL_STAGES_128x2 = 20,
    CUBLASLT_MATMUL_STAGES_128x3 = 21,
    CUBLASLT_MATMUL_STAGES_128x4 = 22,
    CUBLASLT_MATMUL_STAGES_128x5 = 23,
    CUBLASLT_MATMUL_STAGES_128x6 = 24,
    CUBLASLT_MATMUL_STAGES_32x10 = 25,
    CUBLASLT_MATMUL_STAGES_8x4 = 26,
    CUBLASLT_MATMUL_STAGES_16x10 = 27,
    CUBLASLT_MATMUL_STAGES_8x5 = 28,
    CUBLASLT_MATMUL_STAGES_8x3 = 31,
    CUBLASLT_MATMUL_STAGES_8xAUTO = 32,
    CUBLASLT_MATMUL_STAGES_16xAUTO = 33,
    CUBLASLT_MATMUL_STAGES_32xAUTO = 34,
    CUBLASLT_MATMUL_STAGES_64xAUTO = 35,
    CUBLASLT_MATMUL_STAGES_128xAUTO = 36,
    CUBLASLT_MATMUL_STAGES_256xAUTO = 37,
    CUBLASLT_MATMUL_STAGES_END = 38,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Thread Block Cluster size\n\n Typically dimensioned similar to cublasLtMatmulTile_t, with the third coordinate unused at this time."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtClusterShape_t {
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_AUTO = 0,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x1x1 = 2,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_2x1x1 = 3,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_4x1x1 = 4,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x2x1 = 5,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_2x2x1 = 6,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_4x2x1 = 7,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x4x1 = 8,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_2x4x1 = 9,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_4x4x1 = 10,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_8x1x1 = 11,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x8x1 = 12,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_8x2x1 = 13,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_2x8x1 = 14,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_16x1x1 = 15,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x16x1 = 16,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_3x1x1 = 17,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_5x1x1 = 18,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_6x1x1 = 19,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_7x1x1 = 20,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_9x1x1 = 21,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_10x1x1 = 22,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_11x1x1 = 23,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_12x1x1 = 24,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_13x1x1 = 25,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_14x1x1 = 26,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_15x1x1 = 27,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_3x2x1 = 28,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_5x2x1 = 29,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_6x2x1 = 30,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_7x2x1 = 31,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x3x1 = 32,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_2x3x1 = 33,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_3x3x1 = 34,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_4x3x1 = 35,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_5x3x1 = 36,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_3x4x1 = 37,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x5x1 = 38,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_2x5x1 = 39,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_3x5x1 = 40,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x6x1 = 41,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_2x6x1 = 42,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x7x1 = 43,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_2x7x1 = 44,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x9x1 = 45,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x10x1 = 46,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x11x1 = 47,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x12x1 = 48,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x13x1 = 49,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x14x1 = 50,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_1x15x1 = 51,
    #[doc = " Let library pick cluster shape automatically"]
    CUBLASLT_CLUSTER_SHAPE_END = 52,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Inner size of the kernel\n\n Represents various aspects of internal kernel design, that don't impact CUDA grid size but may have other more subtle\n effects.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatmulInnerShape_t {
    CUBLASLT_MATMUL_INNER_SHAPE_UNDEFINED = 0,
    CUBLASLT_MATMUL_INNER_SHAPE_MMA884 = 1,
    CUBLASLT_MATMUL_INNER_SHAPE_MMA1684 = 2,
    CUBLASLT_MATMUL_INNER_SHAPE_MMA1688 = 3,
    CUBLASLT_MATMUL_INNER_SHAPE_MMA16816 = 4,
    CUBLASLT_MATMUL_INNER_SHAPE_END = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Scaling mode for per-matrix scaling"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatmulMatrixScale_t {
    #[doc = " Scaling factors are single precision scalars applied to the whole tensor"]
    CUBLASLT_MATMUL_MATRIX_SCALE_SCALAR_32F = 0,
    #[doc = " Scaling factors are tensors that contain a dedicated scaling factor stored as an 8-bit CUDA_R_8F_UE4M3 value for\neach 16-element block in the innermost dimension of the corresponding data tensor"]
    CUBLASLT_MATMUL_MATRIX_SCALE_VEC16_UE4M3 = 1,
    #[doc = " Same as above, except that scaling factor tensor elements have type CUDA_R_8F_UE8M0 and the block size is 32\nelements"]
    CUBLASLT_MATMUL_MATRIX_SCALE_VEC32_UE8M0 = 2,
    #[doc = " Same as above, except that scaling factor tensor elements have type CUDA_R_8F_UE8M0 and the block size is 32\nelements"]
    CUBLASLT_MATMUL_MATRIX_SCALE_END = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Pointer mode to use for alpha/beta"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtPointerMode_t {
    #[doc = " matches CUBLAS_POINTER_MODE_HOST, pointer targets a single value host memory"]
    CUBLASLT_POINTER_MODE_HOST = 0,
    #[doc = " matches CUBLAS_POINTER_MODE_DEVICE, pointer targets a single value device memory"]
    CUBLASLT_POINTER_MODE_DEVICE = 1,
    #[doc = " pointer targets an array in device memory"]
    CUBLASLT_POINTER_MODE_DEVICE_VECTOR = 2,
    #[doc = " alpha pointer targets an array in device memory, beta is zero. Note:\nCUBLASLT_MATMUL_DESC_ALPHA_VECTOR_BATCH_STRIDE is not supported, must be 0."]
    CUBLASLT_POINTER_MODE_ALPHA_DEVICE_VECTOR_BETA_ZERO = 3,
    #[doc = " alpha pointer targets an array in device memory, beta is a single value in host memory."]
    CUBLASLT_POINTER_MODE_ALPHA_DEVICE_VECTOR_BETA_HOST = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Mask to define pointer mode capability"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtPointerModeMask_t {
    #[doc = " see CUBLASLT_POINTER_MODE_HOST"]
    CUBLASLT_POINTER_MODE_MASK_HOST = 1,
    #[doc = " see CUBLASLT_POINTER_MODE_DEVICE"]
    CUBLASLT_POINTER_MODE_MASK_DEVICE = 2,
    #[doc = " see CUBLASLT_POINTER_MODE_DEVICE_VECTOR"]
    CUBLASLT_POINTER_MODE_MASK_DEVICE_VECTOR = 4,
    #[doc = " see CUBLASLT_POINTER_MODE_ALPHA_DEVICE_VECTOR_BETA_ZERO"]
    CUBLASLT_POINTER_MODE_MASK_ALPHA_DEVICE_VECTOR_BETA_ZERO = 8,
    #[doc = " see CUBLASLT_POINTER_MODE_ALPHA_DEVICE_VECTOR_BETA_HOST"]
    CUBLASLT_POINTER_MODE_MASK_ALPHA_DEVICE_VECTOR_BETA_HOST = 16,
}
pub type cublasLtNumericalImplFlags_t = u64;
unsafe extern "C" {
    #[doc = " Execute matrix multiplication (D = alpha * op(A) * op(B) + beta * C).\n\n \\retval     CUBLAS_STATUS_NOT_INITIALIZED   if cuBLASLt handle has not been initialized\n \\retval     CUBLAS_STATUS_INVALID_VALUE     if parameters are in conflict or in an impossible configuration; e.g.\n                                             when workspaceSizeInBytes is less than workspace required by configured\n                                             algo\n \\retval     CUBLAS_STATUS_NOT_SUPPORTED     if current implementation on selected device doesn't support configured\n                                             operation\n \\retval     CUBLAS_STATUS_ARCH_MISMATCH     if configured operation cannot be run using selected device\n \\retval     CUBLAS_STATUS_EXECUTION_FAILED  if cuda reported execution error from the device\n \\retval     CUBLAS_STATUS_SUCCESS           if the operation completed successfully"]
    pub fn cublasLtMatmul(
        lightHandle: cublasLtHandle_t,
        computeDesc: cublasLtMatmulDesc_t,
        alpha: *const ::std::os::raw::c_void,
        A: *const ::std::os::raw::c_void,
        Adesc: cublasLtMatrixLayout_t,
        B: *const ::std::os::raw::c_void,
        Bdesc: cublasLtMatrixLayout_t,
        beta: *const ::std::os::raw::c_void,
        C: *const ::std::os::raw::c_void,
        Cdesc: cublasLtMatrixLayout_t,
        D: *mut ::std::os::raw::c_void,
        Ddesc: cublasLtMatrixLayout_t,
        algo: *const cublasLtMatmulAlgo_t,
        workspace: *mut ::std::os::raw::c_void,
        workspaceSizeInBytes: usize,
        stream: cudaStream_t,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Matrix layout conversion helper (C = alpha * op(A) + beta * op(B))\n\n Can be used to change memory order of data or to scale and shift the values.\n\n \\retval     CUBLAS_STATUS_NOT_INITIALIZED   if cuBLASLt handle has not been initialized\n \\retval     CUBLAS_STATUS_INVALID_VALUE     if parameters are in conflict or in an impossible configuration; e.g.\n                                             when A is not NULL, but Adesc is NULL\n \\retval     CUBLAS_STATUS_NOT_SUPPORTED     if current implementation on selected device doesn't support configured\n                                             operation\n \\retval     CUBLAS_STATUS_ARCH_MISMATCH     if configured operation cannot be run using selected device\n \\retval     CUBLAS_STATUS_EXECUTION_FAILED  if cuda reported execution error from the device\n \\retval     CUBLAS_STATUS_SUCCESS           if the operation completed successfully"]
    pub fn cublasLtMatrixTransform(
        lightHandle: cublasLtHandle_t,
        transformDesc: cublasLtMatrixTransformDesc_t,
        alpha: *const ::std::os::raw::c_void,
        A: *const ::std::os::raw::c_void,
        Adesc: cublasLtMatrixLayout_t,
        beta: *const ::std::os::raw::c_void,
        B: *const ::std::os::raw::c_void,
        Bdesc: cublasLtMatrixLayout_t,
        C: *mut ::std::os::raw::c_void,
        Cdesc: cublasLtMatrixLayout_t,
        stream: cudaStream_t,
    ) -> cublasStatus_t;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Enum for data ordering"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtOrder_t {
    #[doc = " Column-major\n\n Leading dimension is the stride (in elements) to the beginning of next column in memory."]
    CUBLASLT_ORDER_COL = 0,
    #[doc = " Row major\n\n Leading dimension is the stride (in elements) to the beginning of next row in memory."]
    CUBLASLT_ORDER_ROW = 1,
    #[doc = " Column-major ordered tiles of 32 columns.\n\n Leading dimension is the stride (in elements) to the beginning of next group of 32-columns. E.g. if matrix has 33\n columns and 2 rows, ld must be at least (32) * 2 = 64."]
    CUBLASLT_ORDER_COL32 = 2,
    #[doc = " Column-major ordered tiles of composite tiles with total 32 columns and 8 rows, tile composed of interleaved\n inner tiles of 4 columns within 4 even or odd rows in an alternating pattern.\n\n Leading dimension is the stride (in elements) to the beginning of the first 32 column x 8 row tile for the next\n 32-wide group of columns. E.g. if matrix has 33 columns and 1 row, ld must be at least (32 * 8) * 1 = 256."]
    CUBLASLT_ORDER_COL4_4R2_8C = 3,
    #[doc = " Column-major ordered tiles of composite tiles with total 32 columns ands 32 rows.\n Element offset within the tile is calculated as (((row%8)/2*4+row/8)*2+row%2)*32+col.\n\n Leading dimension is the stride (in elements) to the beginning of the first 32 column x 32 row tile for the next\n 32-wide group of columns. E.g. if matrix has 33 columns and 1 row, ld must be at least (32*32)*1 = 1024."]
    CUBLASLT_ORDER_COL32_2R_4R4 = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Attributes of memory layout"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatrixLayoutAttribute_t {
    #[doc = " Data type, see cudaDataType.\n\n uint32_t"]
    CUBLASLT_MATRIX_LAYOUT_TYPE = 0,
    #[doc = " Memory order of the data, see cublasLtOrder_t.\n\n int32_t, default: CUBLASLT_ORDER_COL"]
    CUBLASLT_MATRIX_LAYOUT_ORDER = 1,
    #[doc = " Number of rows.\n\n Usually only values that can be expressed as int32_t are supported.\n\n uint64_t"]
    CUBLASLT_MATRIX_LAYOUT_ROWS = 2,
    #[doc = " Number of columns.\n\n Usually only values that can be expressed as int32_t are supported.\n\n uint64_t"]
    CUBLASLT_MATRIX_LAYOUT_COLS = 3,
    #[doc = " Matrix leading dimension.\n\n For CUBLASLT_ORDER_COL this is stride (in elements) of matrix column, for more details and documentation for\n other memory orders see documentation for cublasLtOrder_t values.\n\n Currently only non-negative values are supported, must be large enough so that matrix memory locations are not\n overlapping (e.g. greater or equal to CUBLASLT_MATRIX_LAYOUT_ROWS in case of CUBLASLT_ORDER_COL).\n\n int64_t;"]
    CUBLASLT_MATRIX_LAYOUT_LD = 4,
    #[doc = " Number of matmul operations to perform in the batch.\n\n See also CUBLASLT_ALGO_CAP_STRIDED_BATCH_SUPPORT\n\n int32_t, default: 1"]
    CUBLASLT_MATRIX_LAYOUT_BATCH_COUNT = 5,
    #[doc = " Stride (in elements) to the next matrix for strided batch operation.\n\n When matrix type is planar-complex (CUBLASLT_MATRIX_LAYOUT_PLANE_OFFSET != 0), batch stride\n is interpreted by cublasLtMatmul() in number of real valued sub-elements. E.g. for data of type CUDA_C_16F,\n offset of 1024B is encoded as a stride of value 512 (since each element of the real and imaginary matrices\n is a 2B (16bit) floating point type).\n\n NOTE: A bug in cublasLtMatrixTransform() causes it to interpret the batch stride for a planar-complex matrix\n as if it was specified in number of complex elements. Therefore an offset of 1024B must be encoded as stride\n value 256 when calling cublasLtMatrixTransform() (each complex element is 4B with real and imaginary values 2B\n each). This behavior is expected to be corrected in the next major cuBLAS version.\n\n int64_t, default: 0"]
    CUBLASLT_MATRIX_LAYOUT_STRIDED_BATCH_OFFSET = 6,
    #[doc = " Stride (in bytes) to the imaginary plane for planar complex layout.\n\n int64_t, default: 0 - 0 means that layout is regular (real and imaginary parts of complex numbers are interleaved\n in memory in each element)"]
    CUBLASLT_MATRIX_LAYOUT_PLANE_OFFSET = 7,
}
unsafe extern "C" {
    #[doc = " Internal. Do not use directly."]
    pub fn cublasLtMatrixLayoutInit_internal(
        matLayout: cublasLtMatrixLayout_t,
        size: usize,
        type_: cudaDataType,
        rows: u64,
        cols: u64,
        ld: i64,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Create new matrix layout descriptor.\n\n \\retval     CUBLAS_STATUS_ALLOC_FAILED  if memory could not be allocated\n \\retval     CUBLAS_STATUS_SUCCESS       if desciptor was created successfully"]
    pub fn cublasLtMatrixLayoutCreate(
        matLayout: *mut cublasLtMatrixLayout_t,
        type_: cudaDataType,
        rows: u64,
        cols: u64,
        ld: i64,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Destroy matrix layout descriptor.\n\n \\retval     CUBLAS_STATUS_SUCCESS  if operation was successful"]
    pub fn cublasLtMatrixLayoutDestroy(matLayout: cublasLtMatrixLayout_t) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Set matrix layout descriptor attribute.\n\n \\param[in]  matLayout    The descriptor\n \\param[in]  attr         The attribute\n \\param[in]  buf          memory address containing the new value\n \\param[in]  sizeInBytes  size of buf buffer for verification (in bytes)\n\n \\retval     CUBLAS_STATUS_INVALID_VALUE  if buf is NULL or sizeInBytes doesn't match size of internal storage for\n                                          selected attribute\n \\retval     CUBLAS_STATUS_SUCCESS        if attribute was set successfully"]
    pub fn cublasLtMatrixLayoutSetAttribute(
        matLayout: cublasLtMatrixLayout_t,
        attr: cublasLtMatrixLayoutAttribute_t,
        buf: *const ::std::os::raw::c_void,
        sizeInBytes: usize,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Get matrix layout descriptor attribute.\n\n \\param[in]  matLayout    The descriptor\n \\param[in]  attr         The attribute\n \\param[out] buf          memory address containing the new value\n \\param[in]  sizeInBytes  size of buf buffer for verification (in bytes)\n \\param[out] sizeWritten  only valid when return value is CUBLAS_STATUS_SUCCESS. If sizeInBytes is non-zero: number of\n                          bytes actually written, if sizeInBytes is 0: number of bytes needed to write full contents\n\n \\retval     CUBLAS_STATUS_INVALID_VALUE  if sizeInBytes is 0 and sizeWritten is NULL, or if  sizeInBytes is non-zero\n                                          and buf is NULL or sizeInBytes doesn't match size of internal storage for\n                                          selected attribute\n \\retval     CUBLAS_STATUS_SUCCESS        if attribute's value was successfully written to user memory"]
    pub fn cublasLtMatrixLayoutGetAttribute(
        matLayout: cublasLtMatrixLayout_t,
        attr: cublasLtMatrixLayoutAttribute_t,
        buf: *mut ::std::os::raw::c_void,
        sizeInBytes: usize,
        sizeWritten: *mut usize,
    ) -> cublasStatus_t;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Matmul descriptor attributes to define details of the operation."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatmulDescAttributes_t {
    #[doc = " Compute type, see cudaDataType. Defines data type used for multiply and accumulate operations and the\n accumulator during matrix multiplication.\n\n int32_t"]
    CUBLASLT_MATMUL_DESC_COMPUTE_TYPE = 0,
    #[doc = " Scale type, see cudaDataType. Defines data type of alpha and beta. Accumulator and value from matrix C are\n typically converted to scale type before final scaling. Value is then converted from scale type to type of matrix\n D before being stored in memory.\n\n int32_t, default: same as CUBLASLT_MATMUL_DESC_COMPUTE_TYPE"]
    CUBLASLT_MATMUL_DESC_SCALE_TYPE = 1,
    #[doc = " Pointer mode of alpha and beta, see cublasLtPointerMode_t. When CUBLASLT_POINTER_MODE_DEVICE_VECTOR is in use,\n alpha/beta vector lenghts must match number of output matrix rows.\n\n int32_t, default: CUBLASLT_POINTER_MODE_HOST"]
    CUBLASLT_MATMUL_DESC_POINTER_MODE = 2,
    #[doc = " Transform of matrix A, see cublasOperation_t.\n\n int32_t, default: CUBLAS_OP_N"]
    CUBLASLT_MATMUL_DESC_TRANSA = 3,
    #[doc = " Transform of matrix B, see cublasOperation_t.\n\n int32_t, default: CUBLAS_OP_N"]
    CUBLASLT_MATMUL_DESC_TRANSB = 4,
    #[doc = " Transform of matrix C, see cublasOperation_t.\n\n Currently only CUBLAS_OP_N is supported.\n\n int32_t, default: CUBLAS_OP_N"]
    CUBLASLT_MATMUL_DESC_TRANSC = 5,
    #[doc = " Matrix fill mode, see cublasFillMode_t.\n\n int32_t, default: CUBLAS_FILL_MODE_FULL"]
    CUBLASLT_MATMUL_DESC_FILL_MODE = 6,
    #[doc = " Epilogue function, see cublasLtEpilogue_t.\n\n uint32_t, default: CUBLASLT_EPILOGUE_DEFAULT"]
    CUBLASLT_MATMUL_DESC_EPILOGUE = 7,
    #[doc = " Bias or bias gradient vector pointer in the device memory.\n\n Bias case. See CUBLASLT_EPILOGUE_BIAS.\n For bias data type see CUBLASLT_MATMUL_DESC_BIAS_DATA_TYPE.\n\n Bias vector length must match matrix D rows count.\n\n Bias gradient case. See CUBLASLT_EPILOGUE_DRELU_BGRAD and CUBLASLT_EPILOGUE_DGELU_BGRAD.\n Bias gradient vector elements are the same type as the output elements\n (Ctype) with the exception of IMMA kernels (see above).\n\n Routines that don't dereference this pointer, like cublasLtMatmulAlgoGetHeuristic()\n depend on its value to determine expected pointer alignment.\n\n Bias case: const void *, default: NULL\n Bias gradient case: void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_BIAS_POINTER = 8,
    #[doc = " Batch stride for bias or bias gradient vector.\n\n Used together with CUBLASLT_MATMUL_DESC_BIAS_POINTER when matrix D's CUBLASLT_MATRIX_LAYOUT_BATCH_COUNT > 1.\n\n int64_t, default: 0"]
    CUBLASLT_MATMUL_DESC_BIAS_BATCH_STRIDE = 10,
    #[doc = " Pointer for epilogue auxiliary buffer.\n\n - Output vector for ReLu bit-mask in forward pass when CUBLASLT_EPILOGUE_RELU_AUX\n   or CUBLASLT_EPILOGUE_RELU_AUX_BIAS epilogue is used.\n - Input vector for ReLu bit-mask in backward pass when\n   CUBLASLT_EPILOGUE_DRELU_BGRAD epilogue is used.\n\n - Output of GELU input matrix in forward pass when\n   CUBLASLT_EPILOGUE_GELU_AUX_BIAS epilogue is used.\n - Input of GELU input matrix for backward pass when\n   CUBLASLT_EPILOGUE_DGELU_BGRAD epilogue is used.\n\n For aux data type see CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_DATA_TYPE.\n\n Routines that don't dereference this pointer, like cublasLtMatmulAlgoGetHeuristic()\n depend on its value to determine expected pointer alignment.\n\n Requires setting CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_LD attribute.\n\n Forward pass: void *, default: NULL\n Backward pass: const void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER = 11,
    #[doc = " Leading dimension for epilogue auxiliary buffer.\n\n - ReLu bit-mask matrix leading dimension in elements (i.e. bits)\n   when CUBLASLT_EPILOGUE_RELU_AUX, CUBLASLT_EPILOGUE_RELU_AUX_BIAS or CUBLASLT_EPILOGUE_DRELU_BGRAD epilogue is\n used. Must be divisible by 128 and be no less than the number of rows in the output matrix.\n\n - GELU input matrix leading dimension in elements\n   when CUBLASLT_EPILOGUE_GELU_AUX_BIAS or CUBLASLT_EPILOGUE_DGELU_BGRAD epilogue used.\n   Must be divisible by 8 and be no less than the number of rows in the output matrix.\n\n int64_t, default: 0"]
    CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_LD = 12,
    #[doc = " Batch stride for epilogue auxiliary buffer.\n\n - ReLu bit-mask matrix batch stride in elements (i.e. bits)\n   when CUBLASLT_EPILOGUE_RELU_AUX, CUBLASLT_EPILOGUE_RELU_AUX_BIAS or CUBLASLT_EPILOGUE_DRELU_BGRAD epilogue is\n used. Must be divisible by 128.\n\n - GELU input matrix batch stride in elements\n   when CUBLASLT_EPILOGUE_GELU_AUX_BIAS or CUBLASLT_EPILOGUE_DGELU_BGRAD epilogue used.\n   Must be divisible by 8.\n\n int64_t, default: 0"]
    CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_BATCH_STRIDE = 13,
    #[doc = " Batch stride for alpha vector.\n\n Used together with CUBLASLT_POINTER_MODE_ALPHA_DEVICE_VECTOR_BETA_HOST when matrix D's\n CUBLASLT_MATRIX_LAYOUT_BATCH_COUNT > 1. If CUBLASLT_POINTER_MODE_ALPHA_DEVICE_VECTOR_BETA_ZERO is set then\n CUBLASLT_MATMUL_DESC_ALPHA_VECTOR_BATCH_STRIDE must be set to 0 as this mode doesnt supported batched alpha vector.\n\n int64_t, default: 0"]
    CUBLASLT_MATMUL_DESC_ALPHA_VECTOR_BATCH_STRIDE = 14,
    #[doc = " Number of SMs to target for parallel execution. Optimizes heuristics for execution on a different number of SMs\n  when user expects a concurrent stream to be using some of the device resources.\n\n  int32_t, default: 0 - use the number reported by the device."]
    CUBLASLT_MATMUL_DESC_SM_COUNT_TARGET = 15,
    #[doc = " Device pointer to the scale factor value that converts data in matrix A to the compute data type range.\n\n  The scaling factor value must have the same type as the compute type.\n\n  If not specified, or set to NULL, the scaling factor is assumed to be 1.\n\n  If set for an unsupported matrix data, scale, and compute type combination, calling cublasLtMatmul()\n  will return CUBLAS_INVALID_VALUE.\n\n  const void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_A_SCALE_POINTER = 17,
    #[doc = " Device pointer to the scale factor value to convert data in matrix B to compute data type range.\n\n  The scaling factor value must have the same type as the compute type.\n\n  If not specified, or set to NULL, the scaling factor is assumed to be 1.\n\n  If set for an unsupported matrix data, scale, and compute type combination, calling cublasLtMatmul()\n  will return CUBLAS_INVALID_VALUE.\n\n  const void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_B_SCALE_POINTER = 18,
    #[doc = " Device pointer to the scale factor value to convert data in matrix C to compute data type range.\n\n  The scaling factor value must have the same type as the compute type.\n\n  If not specified, or set to NULL, the scaling factor is assumed to be 1.\n\n  If set for an unsupported matrix data, scale, and compute type combination, calling cublasLtMatmul()\n  will return CUBLAS_INVALID_VALUE.\n\n  const void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_C_SCALE_POINTER = 19,
    #[doc = " Device pointer to the scale factor value to convert data in matrix D to compute data type range.\n\n  The scaling factor value must have the same type as the compute type.\n\n  If not specified, or set to NULL, the scaling factor is assumed to be 1.\n\n  If set for an unsupported matrix data, scale, and compute type combination, calling cublasLtMatmul()\n  will return CUBLAS_INVALID_VALUE.\n\n  const void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_D_SCALE_POINTER = 20,
    #[doc = " Device pointer to the memory location that on completion will be set to the maximum of absolute values in the\n  output matrix.\n\n  The computed value has the same type as the compute type.\n\n  If not specified or set to NULL, the maximum absolute value is not computed. If set for an unsupported matrix\n  data, scale, and compute type combination, calling cublasLtMatmul() will return CUBLAS_INVALID_VALUE.\n\n  void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_AMAX_D_POINTER = 21,
    #[doc = " Type of the data to be stored to the memory pointed to by CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER.\n\n  If unset, the data type defaults to the type of elements of the output matrix with some exceptions, see details\n below.\n\n  ReLu uses a bit-mask.\n\n  GELU input matrix elements type is the same as the type of elements of\n  the output matrix with some exceptions, see details below.\n\n  For fp8 kernels with output type CUDA_R_8F_E4M3 the aux data type can be CUDA_R_8F_E4M3 or CUDA_R_16F with some\n  restrictions.  See https://docs.nvidia.com/cuda/cublas/index.html#cublasLtMatmulDescAttributes_t for more details.\n\n  If set for an unsupported matrix data, scale, and compute type combination, calling cublasLtMatmul()\n  will return CUBLAS_INVALID_VALUE.\n\n  int32_t based on cudaDataType, default: -1"]
    CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_DATA_TYPE = 22,
    #[doc = " Device pointer to the scaling factor value to convert results from compute type data range to storage\n  data range in the auxiliary matrix that is set via CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER.\n\n  The scaling factor value must have the same type as the compute type.\n\n  If not specified, or set to NULL, the scaling factor is assumed to be 1. If set for an unsupported matrix data,\n  scale, and compute type combination, calling cublasLtMatmul() will return CUBLAS_INVALID_VALUE.\n\n  void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_SCALE_POINTER = 23,
    #[doc = " Device pointer to the memory location that on completion will be set to the maximum of absolute values in the\n  buffer that is set via CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER.\n\n  The computed value has the same type as the compute type.\n\n  If not specified or set to NULL, the maximum absolute value is not computed. If set for an unsupported matrix\n  data, scale, and compute type combination, calling cublasLtMatmul() will return CUBLAS_INVALID_VALUE.\n\n  void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_AMAX_POINTER = 24,
    #[doc = " Flag for managing fp8 fast accumulation mode.\n  When enabled, problem execution might be faster but at the cost of lower accuracy because intermediate results\n  will not periodically be promoted to a higher precision.\n\n  int8_t, default: 0 - fast accumulation mode is disabled."]
    CUBLASLT_MATMUL_DESC_FAST_ACCUM = 25,
    #[doc = " Type of bias or bias gradient vector in the device memory.\n\n Bias case: see CUBLASLT_EPILOGUE_BIAS.\n\n Bias vector elements are the same type as the elements of output matrix (Dtype) with the following exceptions:\n - IMMA kernels with computeType=CUDA_R_32I and Ctype=CUDA_R_8I where the bias vector elements\n   are the same type as alpha, beta (CUBLASLT_MATMUL_DESC_SCALE_TYPE=CUDA_R_32F)\n - fp8 kernels with an output type of CUDA_R_32F, CUDA_R_8F_E4M3 or CUDA_R_8F_E5M2, See\n   https://docs.nvidia.com/cuda/cublas/index.html#cublasLtMatmul for details.\n\n int32_t based on cudaDataType, default: -1"]
    CUBLASLT_MATMUL_DESC_BIAS_DATA_TYPE = 26,
    #[doc = " EXPERIMENTAL, DEPRECATED: Number of atomic synchronization chunks in the row dimension of the output matrix D.\n\n int32_t, default 0 (atomic synchronization disabled)"]
    CUBLASLT_MATMUL_DESC_ATOMIC_SYNC_NUM_CHUNKS_D_ROWS = 27,
    #[doc = " EXPERIMENTAL, DEPRECATED: Number of atomic synchronization chunks in the column dimension of the output matrix D.\n\n int32_t, default 0 (atomic synchronization disabled)"]
    CUBLASLT_MATMUL_DESC_ATOMIC_SYNC_NUM_CHUNKS_D_COLS = 28,
    #[doc = " EXPERIMENTAL: Pointer to a device array of input atomic counters consumed by a matmul.\n\n int32_t *, default: NULL"]
    CUBLASLT_MATMUL_DESC_ATOMIC_SYNC_IN_COUNTERS_POINTER = 29,
    #[doc = " EXPERIMENTAL: Pointer to a device array of output atomic counters produced by a matmul.\n\n int32_t *, default: NULL"]
    CUBLASLT_MATMUL_DESC_ATOMIC_SYNC_OUT_COUNTERS_POINTER = 30,
    #[doc = " Scaling mode that defines how the matrix scaling factor for matrix A is interpreted\n\n int32_t, default: 0"]
    CUBLASLT_MATMUL_DESC_A_SCALE_MODE = 31,
    #[doc = " Scaling mode that defines how the matrix scaling factor for matrix B is interpreted\n\n int32_t, default: 0"]
    CUBLASLT_MATMUL_DESC_B_SCALE_MODE = 32,
    #[doc = " Scaling mode that defines how the matrix scaling factor for matrix C is interpreted\n\n int32_t, default: 0"]
    CUBLASLT_MATMUL_DESC_C_SCALE_MODE = 33,
    #[doc = " Scaling mode that defines how the matrix scaling factor for matrix D is interpreted\n\n int32_t, default: 0"]
    CUBLASLT_MATMUL_DESC_D_SCALE_MODE = 34,
    #[doc = " Scaling mode that defines how the matrix scaling factor for the auxiliary matrix is interpreted\n\n int32_t, default: 0"]
    CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_SCALE_MODE = 35,
    #[doc = " Device pointer to the scale factors that are used to convert data in matrix D to the compute data type range.\n\n  The scaling factor value type is defined by the scaling mode (see CUBLASLT_MATMUL_DESC_D_OUT_SCALE_MODE)\n\n  If set for an unsupported matrix data, scale, scale mode, and compute type combination, calling cublasLtMatmul()\n  will return CUBLAS_INVALID_VALUE.\n\n  void *, default: NULL"]
    CUBLASLT_MATMUL_DESC_D_OUT_SCALE_POINTER = 36,
    #[doc = " Scaling mode that defines how the output matrix scaling factor for matrix D is interpreted\n\n int32_t, default: 0"]
    CUBLASLT_MATMUL_DESC_D_OUT_SCALE_MODE = 37,
}
unsafe extern "C" {
    #[doc = " Internal. Do not use directly."]
    pub fn cublasLtMatmulDescInit_internal(
        matmulDesc: cublasLtMatmulDesc_t,
        size: usize,
        computeType: cublasComputeType_t,
        scaleType: cudaDataType_t,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Create new matmul operation descriptor.\n\n \\retval     CUBLAS_STATUS_ALLOC_FAILED  if memory could not be allocated\n \\retval     CUBLAS_STATUS_SUCCESS       if desciptor was created successfully"]
    pub fn cublasLtMatmulDescCreate(
        matmulDesc: *mut cublasLtMatmulDesc_t,
        computeType: cublasComputeType_t,
        scaleType: cudaDataType_t,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Destroy matmul operation descriptor.\n\n \\retval     CUBLAS_STATUS_SUCCESS  if operation was successful"]
    pub fn cublasLtMatmulDescDestroy(matmulDesc: cublasLtMatmulDesc_t) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Set matmul operation descriptor attribute.\n\n \\param[in]  matmulDesc   The descriptor\n \\param[in]  attr         The attribute\n \\param[in]  buf          memory address containing the new value\n \\param[in]  sizeInBytes  size of buf buffer for verification (in bytes)\n\n \\retval     CUBLAS_STATUS_INVALID_VALUE  if buf is NULL or sizeInBytes doesn't match size of internal storage for\n                                          selected attribute\n \\retval     CUBLAS_STATUS_SUCCESS        if attribute was set successfully"]
    pub fn cublasLtMatmulDescSetAttribute(
        matmulDesc: cublasLtMatmulDesc_t,
        attr: cublasLtMatmulDescAttributes_t,
        buf: *const ::std::os::raw::c_void,
        sizeInBytes: usize,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Get matmul operation descriptor attribute.\n\n \\param[in]  matmulDesc   The descriptor\n \\param[in]  attr         The attribute\n \\param[out] buf          memory address containing the new value\n \\param[in]  sizeInBytes  size of buf buffer for verification (in bytes)\n \\param[out] sizeWritten  only valid when return value is CUBLAS_STATUS_SUCCESS. If sizeInBytes is non-zero: number of\n                          bytes actually written, if sizeInBytes is 0: number of bytes needed to write full contents\n\n \\retval     CUBLAS_STATUS_INVALID_VALUE  if sizeInBytes is 0 and sizeWritten is NULL, or if  sizeInBytes is non-zero\n                                          and buf is NULL or sizeInBytes doesn't match size of internal storage for\n                                          selected attribute\n \\retval     CUBLAS_STATUS_SUCCESS        if attribute's value was successfully written to user memory"]
    pub fn cublasLtMatmulDescGetAttribute(
        matmulDesc: cublasLtMatmulDesc_t,
        attr: cublasLtMatmulDescAttributes_t,
        buf: *mut ::std::os::raw::c_void,
        sizeInBytes: usize,
        sizeWritten: *mut usize,
    ) -> cublasStatus_t;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Matrix transform descriptor attributes to define details of the operation."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatrixTransformDescAttributes_t {
    #[doc = " Scale type, see cudaDataType. Inputs are converted to scale type for scaling and summation and results are then\n converted to output type to store in memory.\n\n int32_t"]
    CUBLASLT_MATRIX_TRANSFORM_DESC_SCALE_TYPE = 0,
    #[doc = " Pointer mode of alpha and beta, see cublasLtPointerMode_t.\n\n int32_t, default: CUBLASLT_POINTER_MODE_HOST"]
    CUBLASLT_MATRIX_TRANSFORM_DESC_POINTER_MODE = 1,
    #[doc = " Transform of matrix A, see cublasOperation_t.\n\n int32_t, default: CUBLAS_OP_N"]
    CUBLASLT_MATRIX_TRANSFORM_DESC_TRANSA = 2,
    #[doc = " Transform of matrix B, see cublasOperation_t.\n\n int32_t, default: CUBLAS_OP_N"]
    CUBLASLT_MATRIX_TRANSFORM_DESC_TRANSB = 3,
}
unsafe extern "C" {
    #[doc = " Internal. Do not use directly."]
    pub fn cublasLtMatrixTransformDescInit_internal(
        transformDesc: cublasLtMatrixTransformDesc_t,
        size: usize,
        scaleType: cudaDataType,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Create new matrix transform operation descriptor.\n\n \\retval     CUBLAS_STATUS_ALLOC_FAILED  if memory could not be allocated\n \\retval     CUBLAS_STATUS_SUCCESS       if desciptor was created successfully"]
    pub fn cublasLtMatrixTransformDescCreate(
        transformDesc: *mut cublasLtMatrixTransformDesc_t,
        scaleType: cudaDataType,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Destroy matrix transform operation descriptor.\n\n \\retval     CUBLAS_STATUS_SUCCESS  if operation was successful"]
    pub fn cublasLtMatrixTransformDescDestroy(
        transformDesc: cublasLtMatrixTransformDesc_t,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Set matrix transform operation descriptor attribute.\n\n \\param[in]  transformDesc  The descriptor\n \\param[in]  attr           The attribute\n \\param[in]  buf            memory address containing the new value\n \\param[in]  sizeInBytes    size of buf buffer for verification (in bytes)\n\n \\retval     CUBLAS_STATUS_INVALID_VALUE  if buf is NULL or sizeInBytes doesn't match size of internal storage for\n                                          selected attribute\n \\retval     CUBLAS_STATUS_SUCCESS        if attribute was set successfully"]
    pub fn cublasLtMatrixTransformDescSetAttribute(
        transformDesc: cublasLtMatrixTransformDesc_t,
        attr: cublasLtMatrixTransformDescAttributes_t,
        buf: *const ::std::os::raw::c_void,
        sizeInBytes: usize,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Get matrix transform operation descriptor attribute.\n\n \\param[in]  transformDesc  The descriptor\n \\param[in]  attr           The attribute\n \\param[out] buf            memory address containing the new value\n \\param[in]  sizeInBytes    size of buf buffer for verification (in bytes)\n \\param[out] sizeWritten    only valid when return value is CUBLAS_STATUS_SUCCESS. If sizeInBytes is non-zero: number\n of bytes actually written, if sizeInBytes is 0: number of bytes needed to write full contents\n\n \\retval     CUBLAS_STATUS_INVALID_VALUE  if sizeInBytes is 0 and sizeWritten is NULL, or if  sizeInBytes is non-zero\n                                          and buf is NULL or sizeInBytes doesn't match size of internal storage for\n                                          selected attribute\n \\retval     CUBLAS_STATUS_SUCCESS        if attribute's value was successfully written to user memory"]
    pub fn cublasLtMatrixTransformDescGetAttribute(
        transformDesc: cublasLtMatrixTransformDesc_t,
        attr: cublasLtMatrixTransformDescAttributes_t,
        buf: *mut ::std::os::raw::c_void,
        sizeInBytes: usize,
        sizeWritten: *mut usize,
    ) -> cublasStatus_t;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Reduction scheme for portions of the dot-product calculated in parallel (a. k. a. \"split - K\")."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtReductionScheme_t {
    #[doc = " No reduction scheme, dot-product shall be performed in one sequence."]
    CUBLASLT_REDUCTION_SCHEME_NONE = 0,
    #[doc = " Reduction is performed \"in place\" - using the output buffer (and output data type) and counters (in workspace) to\n guarantee the sequentiality."]
    CUBLASLT_REDUCTION_SCHEME_INPLACE = 1,
    #[doc = " Intermediate results are stored in compute type in the workspace and reduced in a separate step."]
    CUBLASLT_REDUCTION_SCHEME_COMPUTE_TYPE = 2,
    #[doc = " Intermediate results are stored in output type in the workspace and reduced in a separate step."]
    CUBLASLT_REDUCTION_SCHEME_OUTPUT_TYPE = 4,
    #[doc = " Intermediate results are stored in output type in the workspace and reduced in a separate step."]
    CUBLASLT_REDUCTION_SCHEME_MASK = 7,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Postprocessing options for the epilogue"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtEpilogue_t {
    #[doc = " No special postprocessing, just scale and quantize results if necessary."]
    CUBLASLT_EPILOGUE_DEFAULT = 1,
    #[doc = " ReLu, apply ReLu point-wise transform to the results (x:=max(x, 0))."]
    CUBLASLT_EPILOGUE_RELU = 2,
    #[doc = " ReLu, apply ReLu point-wise transform to the results (x:=max(x, 0)).\n\n This epilogue mode produces an extra output, a ReLu bit-mask matrix,\n see CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER."]
    CUBLASLT_EPILOGUE_RELU_AUX = 130,
    #[doc = " Bias, apply (broadcasted) Bias from bias vector. Bias vector length must match matrix D rows, it must be packed\n (stride between vector elements is 1). Bias vector is broadcasted to all columns and added before applying final\n postprocessing."]
    CUBLASLT_EPILOGUE_BIAS = 4,
    #[doc = " ReLu and Bias, apply Bias and then ReLu transform"]
    CUBLASLT_EPILOGUE_RELU_BIAS = 6,
    #[doc = " ReLu and Bias, apply Bias and then ReLu transform\n\n This epilogue mode produces an extra output, a ReLu bit-mask matrix,\n see CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER."]
    CUBLASLT_EPILOGUE_RELU_AUX_BIAS = 134,
    #[doc = " ReLu and Bias, apply Bias and then ReLu transform\n\n This epilogue mode produces an extra output, a ReLu bit-mask matrix,\n see CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER."]
    CUBLASLT_EPILOGUE_DRELU = 136,
    #[doc = " ReLu and Bias, apply Bias and then ReLu transform\n\n This epilogue mode produces an extra output, a ReLu bit-mask matrix,\n see CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER."]
    CUBLASLT_EPILOGUE_DRELU_BGRAD = 152,
    #[doc = " GELU, apply GELU point-wise transform to the results (x:=GELU(x))."]
    CUBLASLT_EPILOGUE_GELU = 32,
    #[doc = " GELU, apply GELU point-wise transform to the results (x:=GELU(x)).\n\n This epilogue mode outputs GELU input as a separate matrix (useful for training).\n See CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER."]
    CUBLASLT_EPILOGUE_GELU_AUX = 160,
    #[doc = " GELU and Bias, apply Bias and then GELU transform"]
    CUBLASLT_EPILOGUE_GELU_BIAS = 36,
    #[doc = " GELU and Bias, apply Bias and then GELU transform\n\n This epilogue mode outputs GELU input as a separate matrix (useful for training).\n See CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER."]
    CUBLASLT_EPILOGUE_GELU_AUX_BIAS = 164,
    #[doc = " GELU and Bias, apply Bias and then GELU transform\n\n This epilogue mode outputs GELU input as a separate matrix (useful for training).\n See CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER."]
    CUBLASLT_EPILOGUE_DGELU = 192,
    #[doc = " GELU and Bias, apply Bias and then GELU transform\n\n This epilogue mode outputs GELU input as a separate matrix (useful for training).\n See CUBLASLT_MATMUL_DESC_EPILOGUE_AUX_POINTER."]
    CUBLASLT_EPILOGUE_DGELU_BGRAD = 208,
    #[doc = " Bias gradient based on the input matrix A.\n\n The bias size corresponds to the number of rows of the matrix D.\n The reduction happens over the GEMM's \"k\" dimension.\n\n Stores Bias gradient in the auxiliary output\n (see CUBLASLT_MATMUL_DESC_BIAS_POINTER)."]
    CUBLASLT_EPILOGUE_BGRADA = 256,
    #[doc = " Bias gradient based on the input matrix B.\n\n The bias size corresponds to the number of columns of the matrix D.\n The reduction happens over the GEMM's \"k\" dimension.\n\n Stores Bias gradient in the auxiliary output\n (see CUBLASLT_MATMUL_DESC_BIAS_POINTER)."]
    CUBLASLT_EPILOGUE_BGRADB = 512,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Matmul heuristic search mode"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatmulSearch_t {
    #[doc = " ask heuristics for best algo for given usecase"]
    CUBLASLT_SEARCH_BEST_FIT = 0,
    #[doc = " only try to find best config for preconfigured algo id"]
    CUBLASLT_SEARCH_LIMITED_BY_ALGO_ID = 1,
    #[doc = " reserved for future use"]
    CUBLASLT_SEARCH_RESERVED_02 = 2,
    #[doc = " reserved for future use"]
    CUBLASLT_SEARCH_RESERVED_03 = 3,
    #[doc = " reserved for future use"]
    CUBLASLT_SEARCH_RESERVED_04 = 4,
    #[doc = " reserved for future use"]
    CUBLASLT_SEARCH_RESERVED_05 = 5,
    #[doc = " reserved for future use"]
    CUBLASLT_SEARCH_RESERVED_06 = 6,
    #[doc = " reserved for future use"]
    CUBLASLT_SEARCH_RESERVED_07 = 7,
    #[doc = " reserved for future use"]
    CUBLASLT_SEARCH_RESERVED_08 = 8,
    #[doc = " reserved for future use"]
    CUBLASLT_SEARCH_RESERVED_09 = 9,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Algo search preference to fine tune the heuristic function."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cublasLtMatmulPreferenceAttributes_t {
    #[doc = " Search mode, see cublasLtMatmulSearch_t.\n\n uint32_t, default: CUBLASLT_SEARCH_BEST_FIT"]
    CUBLASLT_MATMUL_PREF_SEARCH_MODE = 0,
    #[doc = " Maximum allowed workspace size in bytes.\n\n uint64_t, default: 0 - no workspace allowed"]
    CUBLASLT_MATMUL_PREF_MAX_WORKSPACE_BYTES = 1,
    #[doc = " Reduction scheme mask, see cublasLtReductionScheme_t. Filters heuristic result to only include algo configs that\n use one of the required modes.\n\n E.g. mask value of 0x03 will allow only INPLACE and COMPUTE_TYPE reduction schemes.\n\n uint32_t, default: CUBLASLT_REDUCTION_SCHEME_MASK (allows all reduction schemes)"]
    CUBLASLT_MATMUL_PREF_REDUCTION_SCHEME_MASK = 3,
    #[doc = " Minimum buffer alignment for matrix A (in bytes).\n\n Selecting a smaller value will exclude algorithms that can not work with matrix A that is not as strictly aligned\n as they need.\n\n uint32_t, default: 256"]
    CUBLASLT_MATMUL_PREF_MIN_ALIGNMENT_A_BYTES = 5,
    #[doc = " Minimum buffer alignment for matrix B (in bytes).\n\n Selecting a smaller value will exclude algorithms that can not work with matrix B that is not as strictly aligned\n as they need.\n\n uint32_t, default: 256"]
    CUBLASLT_MATMUL_PREF_MIN_ALIGNMENT_B_BYTES = 6,
    #[doc = " Minimum buffer alignment for matrix C (in bytes).\n\n Selecting a smaller value will exclude algorithms that can not work with matrix C that is not as strictly aligned\n as they need.\n\n uint32_t, default: 256"]
    CUBLASLT_MATMUL_PREF_MIN_ALIGNMENT_C_BYTES = 7,
    #[doc = " Minimum buffer alignment for matrix D (in bytes).\n\n Selecting a smaller value will exclude algorithms that can not work with matrix D that is not as strictly aligned\n as they need.\n\n uint32_t, default: 256"]
    CUBLASLT_MATMUL_PREF_MIN_ALIGNMENT_D_BYTES = 8,
    #[doc = " Maximum wave count.\n\n See cublasLtMatmulHeuristicResult_t::wavesCount.\n\n Selecting a non-zero value will exclude algorithms that report device utilization higher than specified.\n\n float, default: 0.0f"]
    CUBLASLT_MATMUL_PREF_MAX_WAVES_COUNT = 9,
    #[doc = " Numerical implementation details mask, see cublasLtNumericalImplFlags_t. Filters heuristic result to only include\n algorithms that use the allowed implementations.\n\n uint64_t, default: uint64_t(-1) (allow everything)"]
    CUBLASLT_MATMUL_PREF_IMPL_MASK = 12,
}
unsafe extern "C" {
    #[doc = " Internal. Do not use directly."]
    pub fn cublasLtMatmulPreferenceInit_internal(
        pref: cublasLtMatmulPreference_t,
        size: usize,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Create new matmul heuristic search preference descriptor.\n\n \\retval     CUBLAS_STATUS_ALLOC_FAILED  if memory could not be allocated\n \\retval     CUBLAS_STATUS_SUCCESS       if desciptor was created successfully"]
    pub fn cublasLtMatmulPreferenceCreate(pref: *mut cublasLtMatmulPreference_t) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Destroy matmul heuristic search preference descriptor.\n\n \\retval     CUBLAS_STATUS_SUCCESS  if operation was successful"]
    pub fn cublasLtMatmulPreferenceDestroy(pref: cublasLtMatmulPreference_t) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Set matmul heuristic search preference descriptor attribute.\n\n \\param[in]  pref         The descriptor\n \\param[in]  attr         The attribute\n \\param[in]  buf          memory address containing the new value\n \\param[in]  sizeInBytes  size of buf buffer for verification (in bytes)\n\n \\retval     CUBLAS_STATUS_INVALID_VALUE  if buf is NULL or sizeInBytes doesn't match size of internal storage for\n                                          selected attribute\n \\retval     CUBLAS_STATUS_SUCCESS        if attribute was set successfully"]
    pub fn cublasLtMatmulPreferenceSetAttribute(
        pref: cublasLtMatmulPreference_t,
        attr: cublasLtMatmulPreferenceAttributes_t,
        buf: *const ::std::os::raw::c_void,
        sizeInBytes: usize,
    ) -> cublasStatus_t;
}
unsafe extern "C" {
    #[doc = " Get matmul heuristic search preference descriptor attribute.\n\n \\param[in]  pref         The descriptor\n \\param[in]  attr         The attribute\n \\param[out] buf          memory address containing the new value\n \\param[in]  sizeInBytes  size of buf buffer for verification (in bytes)\n \\param[out] sizeWritten  only valid when return value is CUBLAS_STATUS_SUCCESS. If sizeInBytes is non-zero: number of\n                          bytes actually written, if sizeInBytes is 0: number of bytes needed to write full contents\n\n \\retval     CUBLAS_STATUS_INVALID_VALUE  if sizeInBytes is 0 and sizeWritten is NULL, or if  sizeInBytes is non-zero\n                                          and buf is NULL or sizeInBytes doesn't match size of internal storage for\n                                          selected attribute\n \\retval     CUBLAS_STATUS_SUCCESS        if attribute's value was successfully written to user memory"]
    pub fn cublasLtMatmulPreferenceGetAttribute(
        pref: cublasLtMatmulPreference_t,
        attr: cublasLtMatmulPreferenceAttributes_t,
        buf: *mut ::std::os::raw::c_void,
        sizeInBytes: usize,
        sizeWritten: *mut usize,
    ) -> cublasStatus_t;
}
#[doc = " Results structure used by cublasLtMatmulAlgoGetHeuristic\n\n Holds returned configured algo descriptor and its runtime properties."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialOrd, PartialEq)]
pub struct cublasLtMatmulHeuristicResult_t {
    #[doc = " Matmul algorithm descriptor.\n\n Must be initialized with cublasLtMatmulAlgoInit() if preferences' CUBLASLT_MATMUL_PERF_SEARCH_MODE is set to\n CUBLASLT_SEARCH_LIMITED_BY_ALGO_ID"]
    pub algo: cublasLtMatmulAlgo_t,
    #[doc = " Actual size of workspace memory required."]
    pub workspaceSize: usize,
    #[doc = " Result status, other fields are only valid if after call to cublasLtMatmulAlgoGetHeuristic() this member is set to\n CUBLAS_STATUS_SUCCESS."]
    pub state: cublasStatus_t,
    #[doc = " Waves count - a device utilization metric.\n\n wavesCount value of 1.0f suggests that when kernel is launched it will fully occupy the GPU."]
    pub wavesCount: f32,
    pub reserved: [::std::os::raw::c_int; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cublasLtMatmulHeuristicResult_t"]
        [::std::mem::size_of::<cublasLtMatmulHeuristicResult_t>() - 96usize];
    ["Alignment of cublasLtMatmulHeuristicResult_t"]
        [::std::mem::align_of::<cublasLtMatmulHeuristicResult_t>() - 8usize];
    ["Offset of field: cublasLtMatmulHeuristicResult_t::algo"]
        [::std::mem::offset_of!(cublasLtMatmulHeuristicResult_t, algo) - 0usize];
    ["Offset of field: cublasLtMatmulHeuristicResult_t::workspaceSize"]
        [::std::mem::offset_of!(cublasLtMatmulHeuristicResult_t, workspaceSize) - 64usize];
    ["Offset of field: cublasLtMatmulHeuristicResult_t::state"]
        [::std::mem::offset_of!(cublasLtMatmulHeuristicResult_t, state) - 72usize];
    ["Offset of field: cublasLtMatmulHeuristicResult_t::wavesCount"]
        [::std::mem::offset_of!(cublasLtMatmulHeuristicResult_t, wavesCount) - 76usize];
    ["Offset of field: cublasLtMatmulHeuristicResult_t::reserved"]
        [::std::mem::offset_of!(cublasLtMatmulHeuristicResult_t, reserved) - 80usize];
};
impl Default for cublasLtMatmulHeuristicResult_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
